"""Ответы к заданию Commits."""

# 1. Опишите своими словами назначение каждого из этих типов коммитов:
# feat, fix, docs, style, refactor, test, build, ci, perf, chore.
# feat: новая функция.
# fix: исправление бага.
# docs: изменения в документации.
# style: изменения внешнего вида или форматирования кода без изменения его функциональности.
# refactor: переработка кода без новой функции и без фикса бага.
# test: изменения в тестах.
# build: изменение зависимостей, конфигурации или добавление новых инструментов.
# ci: изменение/обновление конфигурационных файлов.
# perf: улучшение производительности кода.
# chore: служебные изменения
# 2. Представьте, что вы исправили баг в функции, которая некорректно округляет числа. Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits (используя тип fix).
# fix: fix number rounding error
# 3. Добавление новой функциональности:
# Допустим, вы реализовали новую функцию generateReport в проекте. Сделайте фиктивный коммит с типом feat, отражающий добавление этой функциональности.
# feat: add generateReport function
# 4. Модификация формата кода или стилей:
# Представьте, что вы поправили отступы и форматирование во всём проекте, не меняя логики кода. Сделайте фиктивный коммит с типом style.
# style: format code and fix indentation
# 5. Документация и тестирование:
# Сделайте фиктивный коммит с типом docs, добавляющий или улучшающий документацию для вашей новой функции.
# Сделайте фиктивный коммит с типом test, добавляющий тесты для этой же функции.
# docs: add documentation for generateReport function
# test: add tests for generateReport function.
