#
#
#
# 18.06.2025
#
# Intro:
# -Расскажи о себе
# -Регистрация аккаунтов
# -Kaggle
# -ODS.AI
# Скачивание и установка программ:
# -GitHub Desktop
# -Cursor и VS CODE
# -Python (CPython)
# -Git for Windows
# -Джамборд для учёбы
# Скачайте репозиторий на свой компьютер.
# -Поставьте звезду репозиторию
# -Присоединитесь к команде
# -Сделайте Fork
# -Клонируйте репозиторий
# -Откройте ваш репозиторий в github desktop
# -Введите команды в терминал
#
# Stepik:
# (Курс Python-разработчик с Нуля до Open Source:Линтеры.Git.Github)
# -Введение
# -Введение в Python и Github
# -Скачиваем и устанавливаем программы
# -Переменные среды и пакетный менеджер pip
# -Интерпретатор cpython и pypy
# -Скачиваем репозиторий
# -PEP8 и линтеры
# -Виртуальное окружение и файл зависимостей(8.1 Создаём виртуальное окружение и выгружаем зависимости)
# Виртуальное окружение и файл зависимостей:
# 8.2 Пакетный менеджер для Data Science
# 8.3 Пакетный менеджер нового поколения
# Погружаемся в git
# 9.1 Вносим файлы в гитигнор
# 9.2 Коммитим и пушим в гитхаб
# 9.3 STASH,Откаты, конфликты, командная работа в гитхаб
#
#

#
