# Проект в который вы отправили пул реквест, попадает под определение опенсорса:
#
# 1.  Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
#     Да
# 2.  Напишите название понравившейся компании и ссылку на репозиторий
#     Ravensburger, https://github.com/Ravensburger-Verlag-GmbH/GraviTrax-Connect
# 3.  Проект активно принимает стороннюю помощь?
#     Нет
# 4.  Напишите второе улучшение которое вы сделали
#     Исправила опечатку в файле README.md
# 5.  Посмотрите на коммиты в основной ветке, напишите общее количество
#     26
# 6.  Когда был последний коммит?
#     9.10.2025
# 7.  Сколько контрибьюторов у проекта?
#     3
# 8.  Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
#     Редко, последний коммит был 9.10.2025, до этого 06.05.2025
# 9.  Сколько сейчас открытых ишью?
#     2
# 10. Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
#     нет
# 11. Ведётся ли активное обсуждение ишью?
#     нет
# 12. Есть ли недавно созданные ишью?
#     нет, последнее создано 18.12.2023
# 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
#     да
# 14. Сколько сейчас открытых пул-реквестов?
#     2
# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
#     не быстро
# 16. Есть ли недавно отправленные пул-реквесты?
#     нет, только мой
# 17. Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы
#     увидеть закрытые пул-реквесты.)
#     2.04.2025
