"""opensource."""

# Проект в который вы отправили пул реквест, попадает под определение
# опенсорса:
#
# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл
# LICENSE. Есть
# 2. Напишите название понравившейся компании и ссылку на репозиторий
# https://github.com/firstcontributions/first-contributions
# 3. Проект активно принимает стороннюю помощь? Да
# 4. Напишите второе улучшение которое вы сделали
# 5. Посмотрите на коммиты в основной ветке, напишите общее количество -  2351
# 6. Когда был последний коммит? 36 мин назад
# 7. Сколько контрибьюторов у проекта? 83 700
# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно,
# кликнув по ссылке
#  «Commits» в верхней панели.) приблизительно 10 коммитов в день
# 9. Сколько сейчас открытых ишью? 28
# 10. Быстро ли мейнтейнеры реагируют на ишью после того, когда они
# открываются? 1 минута)
# 11. Ведётся ли активное обсуждение ишью? Да
# 12. Есть ли недавно созданные ишью? Да
# 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните
# на вкладку «Closed»,
#  чтобы увидеть закрытые ишью.) Есть
# 14. Сколько сейчас открытых пул-реквестов? 16
# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия? Не
# очень
# 16. Ведётся ли активное обсуждение пул-реквестов? Ведется
# 17. Есть ли недавно отправленные пул-реквесты? Есть
# 18. Как давно были объединены пул-реквесты? (На странице Pull Request
# GitHub-репозитория щелкните на вкладку
#  «Closed», чтобы увидеть закрытые пул-реквесты.) 1 час назад
