"""intro."""

# 18/08/25
#
# 1. Прошёл intro (за исключением 20 пункта).

# 20/08/25
#
# 1. Прошёл 9 модулей по курсу Python-разработчик с нуля.
# 2. Сделал половину quiz1 task6

# 29/08/25
#
# 1. Прошёл 10-12 модулей по курсу Python-разработчик с нуля.
# 2. Сделал quiz1 task6

# 30/08/25
#
# 1. Закончил курс Python-разработчик с нуля.
# 2. Сделал quiz2 task6

# 05/09/25
#
# 1. Сдал первые два issue (quiz, git)
# 2. Выполнил третий issue - commits

# 08/09/25
#
# 1. Выполнил четвёртый issue - stash
# 2. Выполнил пятый issue - Issues
