"""Журнал действий при выполнении домашнего задания."""

# 1. Создала новую ветку на основе последнего коммита в репозитории Data-Science-For-Beginners-from-scratch-course
# 2. Создала репозиторий quiz.ipynb, ответила в нем на первую часть вопросов - quiz1
# 3. Поняла, что пока не готова сразу выполнить вторую часть задания - quiz2
# 4. Пересохранила файл quiz.ipynb в quiz1.ipynb
# 5. В терминале запустила команду pre-commit run --all-files
# 6. Создала файл log.ipynb
# 7. Отправила домашку на GitHub
#
# 10.08.2026
#
# 1. Скачала с GitHub свою домашку (quiz1.ipynb)
# 2. Доделала вторую часть домашки - quiz2 в этом же файле
# 3. В терминале запустила команду pre-commit run --all-files
# 4. Обнаружила ошибки в коде
# 5. Нашла проблемы через GPT. 
# 6. Исправила ошибка в слове Change
# 7. файл log.ipynb пересохранила в текстовом формате для корректного отображения
# 8. Запустила проверку кода повторно
# 9. Отправила домашку на GitHub
#
