"""Логирование уроков."""

# 31.12.24
#
# 1. Зарегистрировал аккаунты для обучения (работы).
# 2. Установил программы для обучения (работы).
# 3. Присоединился к команде Senatorov.
# 4. Создал свою ветку на ГитХаб репозитории команды Senatorov.
# 5. Клонировал ГитХаб репозиторий команды Senatorov на мой локальный компьютер.
# 6. Установил линтеры на локальную копию репозитория команды Senatorov.
# 7. Перенёс все необходимые файлы и папки с моего старого репозитория.
# 8. Оформил коммит по подготовке свой ветки к работе. 

# 25.01.25
#
# 1. Проверено текущее состояния обучения:
# * выполнен первый issue;
# * по академической теории дошёл до дисперсии дискретной случайной величины.
# 2. Проверен вариант прохождения курса обучения по ресурсам, которые были рекомендованы ранее:
# * учебник Гмурмана В.Е.;
# * учебник Кремера Н.Ш.;
# * видеоматериалы Khan Academy;
# * курсы Stepik;
# * курсы Lektorium;
# * задачники по теории вероятностей.
# 3. Рекомендовано выполнить оставшиеся issues и готовиться к экзамену по теории вероятностей.

# 28.02.25
#
# 1. Проведен экзаменационный контроль по теории вероятности.
# 2. По результатам контроля экзамен не сдан.
# 3. В связи с этим выполнена корректировка дальнейшего курса обучения:
# вместо академического варианта обучения будет изучаться прикладная статистика на Пайтон.

# 07.03.25
#
# 1. Участвовал в групповом уроке по теории вероятности.
# 2. Пройдены следующие вопросы:
# * Случайная величина;
# * Функция распределения;
# * Полигон;
# * Математическое ожидание;
# * Дисперсия;
# * Среднеквадратичная отклонение;
# * Коэффициент вариации;
# * Мода;
# * Медиана;
# * Коэффициент ассиметрии;
# * Эксцесс;
# * Центральные моменты.
# 3. Домашнее задание: завершить выполнение issues, а также научиться вычислять 
# центральные моменты через формулы (не пользуясь таблицами).

# 12.03.25
#
# Участвовал в групповом уроке по теории вероятности:
# 1. Дал определение и общую характеристику основных метрик в теории вероятности.
# 2. Детально охарактеризовал коэффициент вариации и его интерпретации.
# 3. Дал определение и общую характеристику коэффициенту ассиметрии.
# 4. Осуществил вычисления коэффициента ассиметрии для отдельного ряда распределения случайной величины (с помощью преподавателя). 
# 5. Привёл интерпретации коэффициента ассиметрии.
# 6. Изучил общий анализ распределений на графике в контексте коэффициента ассиметрии.
# 7. Дал определение и общую характеристику коэффициенту эксцесса.
# 8. Осуществил вычисления коэффициента эксцесса для отдельного ряда распределения случайной величины (с помощью преподавателя). 
# 9. Привёл интерпретации коэффициента эксцесса.
# 10. Изучил общий анализ кривой распределения в контексте коэффициента эксцесса.
#
# Рекомендовано:
# * повторить весь материал урока;
# * практиковать самостоятельное вычисление вышеуказанных метрик и анализировать распределение на графике. 

# 21.03.25
#
# Участвовал в групповом уроке по теории вероятности:
# 1. Изучил понятие и общую характеристику биномиального распределения, 
# характерные формы графика биномиального распределения.
# 2. Ознакомился с формулой биномиального распределения.
# 3. Проводил вычисления значений с использованием формулы биномиального 
# распределения.
# 4. На основании вычисленных значений:
# * построил таблицу биномиального распределения; 
# * составил функцию биномиального распределения;
# * начертил график биномиального распределения.
# 5. Изучил формулы вычисления математического ожидания, дисперсии и 
# среднеквадратического отклонения для биномиального распределения.

# 28.03.25
#
# Участвовал в индивидуальном уроке по теории вероятности:
# 1. Изучил понятие и общую характеристику пуассоновского распределения.
# 2. Ознакомился с формулой пуассоновского распределения.
# 3. Проводил вычисления значений с использованием таблицы пуассоновского распределения.
# 4. Ознакомился с использованием калькулятора для вычислений значений пуассоновского 
# распределения. 
# 5. Изучил понятие и природу непрерывных случайных величин (включая функцию их распределения, свойства плотности распределения).
# 6. Ознакомился с понятиями пределов и непрерывности функций, а также с понятием производной.

# 04.04.25
#
# Участвовал в индивидуальном уроке по теории вероятности:
# 1. Изучил понятие и природу производной (геометрический и физический смыслы производной).
# 2. Провёл подсчёт производной по определению и по формуле.
# 3. Ознакомился с основными видами производных.
# 4. Изучил понятие и характеристики интеграла.

# 11.04.25
#
# Участвовал в групповом уроке по теории вероятности:
# 1. Изучил феномен модульной функции (в частности, невозможность взять производную).
# 2. Проводил вычисления производной по определению (через предел).
# 3. Ознакомился с порядком получения PDF из CDF.
# 4. Изучил понятие интеграла и интегрирования (в геометрической интерпретации и через предел).
# 5. Ознакомился с неопределённым интегралом.
# 6. Ознакомился с понятием и порядком получения первообразной, понятием множества первообразных. 
# 7. Изучил свойство линейности интегралов.
# 8. Ознакомился с понятием, назначением и характеристиками определённого интеграла.
# 9. Проводил вычисления определённого интеграла.

# 18.04.25
#
# Участвовал в групповом уроке по теории вероятности:
# 1. Вычислял основные метрики для НСВ на конкретных примерах (мат. ожидание, дисперсия и вероятность попадания случайной величины в интервал).
# 2. Строил функцию распределения НСВ.
# 3. Соответствующим образом рисовал график распределения НСВ.

# 25.04.25
#
# Участвовал в групповом уроке по теории вероятности:
# 1. Повторил свойства функций CDF, PDF, PMF - как для ДСВ, так и для НСВ.
# 2. Повторил материал о роли и свойствах интегралов в теории вероятности.
# 3. Изучил применение свойств линейности, аддитивности к интегралу,
# а также зависимость вероятности от площади интеграла. 
# 4. Изучил нормальное распределение Гаусса (включая закон распределения вероятностей,
# функция плотности нормального распределения, построение кривой распределения на основе формулы).

# 02.05.25
#
# Участвовал в групповом уроке по теории вероятности:
#
# 1. Повторил математические основы распределения.
# 2. Выполнил расчёты функции плотности распределения (через формулу, с использованием калькулятора нормального распределения, таблицы значений функции Гаусса)
# 3. Строил график функции плотности распределения.
# 4. Детально рассмотрел функции CDF, PDF (характеристики, расчёты, построение).
# 5. Рассмотрел функцию Лапласа (выполнял расчёты, построение графиков, в частности, с использованием таблицы значений данной функции).
# 6. Изучил правило трёх сигм (трёх стандартных отклонений).

# 09.05.25
#
# Участвовал в групповом уроке по теории вероятности:
#
# 1. Ознакомился с понятием и характеристикой равномерного распределения (юниформ распределения)
# 2. Изучил формулу исчисления равномерного распределения (объяснение, выведение формулы - применение интеграла для составления функции распределения и проч.)
# 3. Проводил исчисления: определял константу, находил основные метрики, составлял функцию CDF и строил график распределения.

# 23.05.25
#
# Участвовал в групповом уроке по статистике (вводный урок, основанный на практических примерах):
#
# 1. Строил полигон распределения (на основе вариационного ряда в форме датасета).
# 2. Считал ключевые метрики.
# 3. Строил выборочную функцию распределения.
# 4. Находил несмещенные оценки математического ожидания и дисперсии.

# 06.06.25
#
# Участвовал в индивидуальном уроке по статистике:
#
# 1. Закрепил ключевые понятия статистики (варианта, вариационный ряд, метрики, генеральная совокупность, выборка и проч.)
# 2. Провёл детальный анализ метрик в статистике, рассмотрел их особенности.

# 13.06.25
#
# Участвовал в индивидуальном уроке по статистике:
#
# 1. Изучил ключевые термины для типов данных в статистике. 
# 2. Изучил ключевые метрики в статистике (метрики положения и метрики вариабельности)
# 3. Проводил исчисление метрик на конкретном датасете.
