"""Урок 1.

Описание что прошли.
"""

# "Урок 1. 2025.03.14 Птн"
#
# 0.1 Я до урока попробовал сам построить случайную величину в Jupiter. Получилось случайная величина - отклонение от прямой
#
# Величина
#
# ![image-2.png](attachment:image-2.png)
#
# Отклонение
#
# ![image-3.png](attachment:image-3.png)
#
#
# 1. Уравнение лин регрессии: одномерная, многомерная
#
# 1.1 добавлен шум
#
# ![image.png](attachment:image.png)
#
# 2. Нахождение (оценка) параметров модели
# > Н: По мне, это не оценка параметров, а расчет параметров. Любопытно почему так называется
# - 1. Метод наименьших квадратов МНК
# - 2. Градиентный спуск
#
# Ищется min Ф ошибок, которая равна квадрату ошибок
#
# learning rate - шаг с которым берем производные
#
#
