"""Лог выполнения."""

# 29/01
#
# 1. Зарегестрировался в GitHub, Kaggle, ODS.AI
# 2. Установил нужные программы
# 3. Скачал репозиторий, создал новую ветку
# 4. Создал файл log.ipynb для отслеживания шагов

# 27/01
#
# 1. Изучил основы линейной регрессии
# 2. Машинное обучение бывают с учителем и без учителя
# 3. Можно удалить лишние параметры (регуляризация)
# 4. Модель нельзя переобучать. Задача в том чтобы линия (в линейной регрессии) проходила прямо, а не по точкам
# 5. Немного познакомился с многомерной регрессией

# 02/02
#
# 1. Познакомился с теоремой Гаyсcа Маркова
# 2. Несмещенная оценка и математическое ожидание
# 3. Гомоскедастичность и гетероскедастичность
