"""Log file shows main items of the lessons learned in the course."""

# 05.03.2025
# Overview of Linear Regression:
# - что такое линейная регрессия:
#     - определение и цель
#     - пример использования
# - types:
#     простая и множественная
# - основн понятия:
#     - переменние
#     - уравнение
#     - гипотеза
# - шум
# - оценка параметров модели:
#     - MSE
#     -градиентн спуск
# - оценка качества модели
# - проверка предположений
# - пере- и недообучение модели
# - регуляризация
# - вид обучения
#     -с учителем
#     - без
# - классификация лин. регрес
#
