"""Ответы на вторую часть домашки по настройке vscode."""

# Список вопросов к видео https://youtu.be/Si9MfV8uJ-0?si=JXHe-tsgOEwSTI5E (НАСТРОЙКА VSCODE, перенос строк, линтеры, работа с ячейками):
#
# (По желанию)В ответе подробно всё опишите и обязательно нужно указывать тайм код из видео где я это сказал, по желанию, дополнительно прикладываем скриншот из видео.
# Если вы знаете ответы на вопросы из Вашего опыта, то таймкоды из видео не надо указывать и т.д.
#
# 1. Как включить автосохранение данных в VSCODE?
# в меню файл выбрать соответствующий пункт меню
# 2. Как настроить перенос строки?
# указать настройку Word wrap column
# 3. Сколько символов по pep8 разрешено на строке?
# 79
# 4. Какие способы переноса строк показаны в видео:
#
# 4.4 Использование круглых скобок для продолжения строки
# long_string = (
#     "This is a very long string that I would like to "
#     "continue on the next line."
# )
# print(long_string)
#
# 4.6 Сложение строк с помощью +
#
# string_part1 = "This is the first part, "
# string_part2 = "and this is the second part."
# full_string = string_part1 + string_part2
# print(full_string)
#
# 5. Проверка на ошибки c помощью кнопки problems, где она находится?
# [problems](image.png)
# там же где terminal
# 6. Где в vscode находится клиент гита? как в нём отправить коммит? как принять домашку?
# три кружочка
# 7. Что такое GIT? он локальный? В нём можно посмотреть историю изменений файлов и вернуться к любому коммиту?
# система контроля версии. да. да.
# 8. Как вставить картинку в маркдаун?
# ctrl+v или [альтернативный текст](путь до картинки)
# 9. Где посмотреть длину строки в vs code?
# в .py файлах показывыается внизу
# 10. Как поменять тип ячейки с питона на маркдаун?
# выбрать нужный формат в низу справа у ячейки
# 11. Как запустить сразу все ячейки в юпитере?
# канажть Run all
# 12. Как изменить размер картинки в юпитере? Нужно для этого знать HTML?
# да, нужна вставить <img> тэг с нужными параметрами
# 13. Какой хоткей чтобы запустить ячейку с смещением на следующую?
# ctrl+Enter
# 14. Как включить отображение номеров строк в юпитере(Cell line numbers)?
# L
# 15. Что такое "Go To" чем это полезно? Как перейти сразу на ошибочную ячейку?
# переходит на проблемную ячейку с ошибкой
# 16. Как очистить вывод ячеек которые уже запущены?
# Clear all outputs
# 17. Как работать одновременно в нескольких файлах в VSCODE? Что такое SPLIT?
# нажать на кнопку split editor (ctrl+\)
# 18. Каким сочетанием убирается левый сайдбар?
# ctrl+b
# 19. Кнопка два листочка это наши локальные файлы?
# да
# 20. Какая ошибка появилась в трассировке при запуске всех ячеек DICT или LIST?
# Dict
# 21. Вы ознакомились с https://t.me/c/1937296927/832/19307? и  https://github.com/adam-p/markdown-here/wiki/Markdown-Cheatsheet?
# да
# 22. Что такое валидация?
# Проверка на достоверность
# 23. Что такое трассировка ошибки?
# понтяное описание
# 24. Что значит отвалился интерпритатор?
# путь, определённый в строке файла скрипта, не указывает на действительный исполняемый файл Python в системе
#
# Отвечаете на вопросы в вашем редакторе кода.
#

#
