"""Квиз."""

# 1) создаёт виртуальное окружение
# 1.1) показывает список пакетов; выгружает зависимости окружения в текстовый файл; устанавливает зависимости из файла
# 2):
# показывает список окружений
# создаёт виртуальное окружение
# устанавливает зависимости в файл
# активирует виртуальное окружение
# деактивирует
# Очищает кэш Conda от всех загруженных пакетов и неиспользуемых файлов
#
# 3)![alt text](<Снимок экрана_2026-09-09_02-41-10-1.png>)
#
# 5)conda install package_name
# pip install package_name
#
# 6) устанавливфет зависимости;
# создает окружение на основе описания
#
# 7):
# показывает список пакетов в текущем окружении
# показывает информацию о пакете
# показывает список пакетов в текущем окружении
# 8) conda
#
#
# 9)![Снимок экрана_2026-09-09_02-51-17.png](<attachment:Снимок экрана_2026-09-09_02-51-17.png>)
# 10) добавил
# 11)для изоляции
#
