"""Практика по Poen Source."""

# 1) Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
# - да файл называется LICENSE.txt
# 2) Напишите название понравившейся компании и ссылку на репозиторий
# - компания называется  statsmodels, ссылка на их репозиторий:
# http://github.com/statsmodels/statsmodels
# 3) Проект активно принимает стороннюю помощь?
# - да, есть свежие issues от 5 дней и более
# 4) Напишите второе улучшение которое вы сделали
# - заменил текст в файле на более читаемый, так же подсветил
# предостережения и визуально улучшил его
# 5) Посмотрите на коммиты в основной ветке, напишите общее количество
# - 15742 коммита
# 6) Когда был последний коммит?
#  - 5 дней назад
# 7) Сколько контрибьюторов у проекта?
#  - 396
# 8) Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
# - очень часто
# Сколько сейчас открытых ишью?
# - 2736
# 9) Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
# - в течении 3-х дней
# 10) Ведётся ли активное обсуждение ишью?
# - да, через Labels можно отсортировань обсуждения и посмотреть их.
# 11) Есть ли недавно созданные ишью?
# - да
# 12) Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
# - да,2841
# 13) Сколько сейчас открытых пул-реквестов?
# - 185
# 14) Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
# - да, до 3-х дней
# 15) Ведётся ли активное обсуждение пул-реквестов?
# - да, так же через Labels можно отсортировать обсыждения и посмотреть их
# 16) Есть ли недавно отправленные пул-реквесты?
# - 3 недели назад
# 17) Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
# - 5 дней назад
