"""Clean code."""

# Схемы регистра имен
#
# Змеиный регистр (snake_case) Имена констант следует записывать в верхнем змеином регистре(UPPER_SNAKE_CASE). Имена функций, методов и переменных записывают в нижнем змеином регистре.
#
# Верблюжий регистр (camelCase)
#
# Схема Pascal (PascalCase). Имена классов необходимо записывать в схеме Pascal.
#
# Первый аргумент методов всегда должен называться self в нижнем регистре.
#
# Первый аргумент методов классов всегда должен называться cls в нижнем
# регистре.
#
# Приватные атрибуты классов всегда начинают с символа подчеркивания ( _ ).
#
# Публичные атрибуты классов никогда не начинают с символа подчеркива-
# ния ( _ ).
#
# Выбирайте имена, пригодные для поиска
#
# Не заменяйте встроенные имена
# Наиболее часто заменяемые имена Python — all, any, date, email, file, format, hash,
# id, input, list, min, max, object, open, random, set, str, sum, test и type. Не берите их
# для своих идентификаторов.
