{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f17c72ad",
   "metadata": {
    "vscode": {
     "languageId": "plaintext"
    }
   },
   "outputs": [],
   "source": [
    "\"\"\"Квиз 4.\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "df42dff7",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "1.Что такое CPython и чем он отличается от Python?\n",
    "CPython это реализация языка Python. Python - это концепция, CPython - программа исполняющая код. Python описывает for, if, Функции. CPython - интерпретирует их.\n",
    "3. Сколько существует реализаций Python, и какая из них самая популярная?\n",
    "6, CPython\n",
    "4. На каком языке написан CPython?\n",
    "На языке C \n",
    "\n",
    "5. (опционально) Кто создал CPython?\n",
    "Гвидо ван Россум\n",
    "6. Почему Python считается быстрым, несмотря на то, что это интерпретируемый язык?\n",
    "Потому что ядро написанно на C, и инструкции он вызывает из С\n",
    "7. Напишите путь к Интерпретатору CPython на вашем компьютере\n",
    "C:\\Users\\artfr\\AppData\\Local\\Python\\pythoncore-3.14-64\n",
    "\n",
    "8. Что содержится в папке include в CPython?\n",
    "Файлы заголовков CPython содержащие информацию, которая нужна для взаимодействия с интерпретатором Python из кода на языках C и C++\n",
    "9. Где можно найти исходный код CPython дайте ссылку на репозиторий гитхаб\n",
    "https://github.com/python/cpython\n",
    "10. (опционально) Как работает интерпретатор CPython при выполнении кода?\n",
    "\n",
    "\n",
    "11. Какая команда используется для запуска файла с помощью CPython?\n",
    "python <путь_до_файла>\\<название_файла>.py\n",
    "\n",
    "12. Можно ли запускать текстовые файлы через интерпретатор Python? Почему?\n",
    "Да. Потому что интерпретатору не важно какое расширение файла. \n",
    "13. Как указать путь к интерпретатору и файлу для выполнения кода?\n",
    "Находи через поиск интерепретатор по слову python -> перейти к расположение объекта -> в верхней строке окна копируем путь. ЛИБО свойста файла -> в окне будет заголовок \"расположение объекта\"\n",
    "14. Чем PyPy отличается от CPython?\n",
    "PyPy работает в 10 раз быстрее, чем пайтон. PyPy реализован в Rpython\n",
    "15. Почему PyPy не может использоваться для всех проектов на Python?\n",
    "Он достаточно новый и несовместим со всеми проектами.\n",
    "16. Где можно скачать PyPy?\n",
    "https://pypy.org\n",
    "\n",
    "17. Как установить PyPy после скачивания?\n",
    "Переходим на сайт, выбираем свою операционку, скачиваем и распаковываем в удобное место.\n",
    "18. Как запустить файл с помощью PyPy?\n",
    "Копируем путь до интерпретатора PyPy + добавляем полное имя с рашсиреним - вставляем в CMD и добавляем путь до файла, который нужно запустить\n",
    "19. Почему PyPy выполняет код быстрее, чем CPython?\n",
    "Благодаря компиляции «точно в срок» (just-in-time, JIT-компиляции). \n",
    "CPython компилирует Python в промежуточный байт-код, который затем интерпретируется виртуальной машиной. PyPy же переводит код Python в машинный код непосредственно перед его выполнением. "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4d4fec49",
   "metadata": {},
   "source": [
    "Задание 1: Поиск и установка CPython\n",
    "\n",
    "Проверьте, установлен ли CPython на вашем компьютере:\n",
    "    Используйте поиск в меню \"Пуск\" (Windows) или терминале (Linux/Mac).\n",
    "    Введите команду python --version или python3 --version в терминале.\n",
    "Если CPython не установлен, скачайте его с официального сайта Python https://www.python.org/downloads/ и установите.\n",
    "\n",
    "ОТВЕТ\n",
    "C:\\Users\\artfr>python --version\n",
    "Python 3.7.4\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c65a636f",
   "metadata": {},
   "source": [
    "Задание 2: Исследование структуры CPython\n",
    "Найдите папку, где установлен Python (например, через команду where python в терминале или свойства ярлыка).\n",
    "Откройте папку include и изучите её содержимое. Какое количество файлов на C там есть?\n",
    "\n",
    "ОТВЕТ\n",
    "Две папка cpython и internal и 79 файлов с расширением .h   - если я правильно понял, что .h - это файл на C\n",
    "\n",
    "\n",
    "Перейдите на [GitHub-репозиторий CPython](https://github.com/python/cpython) и найдите файл README. Прочитайте информацию о проекте. \n",
    "ПРОЧИТАЛ\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7225678a",
   "metadata": {},
   "source": [
    "Задание 3: Запуск файла с помощью CPython\n",
    "Создайте текстовый файл example.txt с содержимым:\n",
    "print(\"Hello from CPython!\")\n",
    "\n",
    "Запустите файл через команду python <путь_до_файла> (замените <путь_до_файла> на фактический путь к вашему файлу).\n",
    "Проверьте, что выводится на экран. Попробуйте изменить расширение файла на .py и повторите запуск.\n",
    "\n",
    "ОТВЕТ\n",
    "C:\\Users\\artfr>python c:\\example.txt\n",
    "Hello from CPython!\n",
    "\n",
    "C:\\Users\\artfr>python c:\\example.py\n",
    "Hello from CPython!"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d21d09cf",
   "metadata": {},
   "source": [
    "Задание 4: Установка и использование PyPy\n",
    "Перейдите на [официальный сайт PyPy](https://www.pypy.org/) и скачайте подходящую версию для вашей операционной системы.\n",
    "Распакуйте скачанный архив в удобное место.\n",
    "Создайте файл example_pypy.py с кодом:\n",
    "print(\"Hello from pypy!\")\n",
    "\n",
    "Запустите файл через PyPy\n",
    "pypy <путь_до_файла> (замените <путь_до_файла> на фактический путь к вашему файлу).\n",
    "Проверьте, что выводится на экран. Попробуйте изменить расширение файла на .py и повторите запуск.\n",
    "\n",
    "ОТВЕТ\n",
    "C:\\Users\\artfr>C:\\Users\\artfr\\machine_learning\\pypy3.11-v7.3.20-win64\\python.exe C:\\Users\\artfr\\machine_learning\\example_pypy.py\n",
    "Hello from pypy!\n",
    "\n",
    "C:\\Users\\artfr>C:\\Users\\artfr\\machine_learning\\pypy3.11-v7.3.20-win64\\python.exe C:\\Users\\artfr\\machine_learning\\example_pypy.txt\n",
    "Hello from pypy!"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "35e28317",
   "metadata": {},
   "source": [
    "Задание 5: Сравнение производительности CPython и PyPy\n",
    "Создайте файл performance_test.py с кодом:\n",
    "    import time\n",
    "    start_time = time.time()\n",
    "    total = 0\n",
    "    for i in range(1, 10000000):\n",
    "        total += i\n",
    "    end_time = time.time()\n",
    "    \n",
    "    print(\"Result:\", total)\n",
    "    print(\"Execution time:\", end_time - start_time, \"seconds\")\n",
    "    \n",
    "Запустите этот файл сначала через CPython, а затем через PyPy. Запишите результаты времени выполнения для обоих интерпретаторов.\n",
    "Сделайте вывод о разнице в производительности.\n",
    "\n",
    "ОТВЕТ\n",
    "python \n",
    "Result: 49999995000000\n",
    "Execution time: 3.628202438354492 seconds\n",
    "\n",
    "PYPY\n",
    "Result: 49999995000000\n",
    "Execution time: 0.1406388282775879 seconds"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
