"""Упражнения."""

# 1) Python - это программное обеспечение с открытым исходным кодом.
# Это то же самое, что и бесплатное ПО?
# Нет, так как исходный код, это когда любой может
# посмотреть что в программе написано, изменить под себя, разработчики
# с разных стран могут учавствовать в его улучшении. А бесплатное
# ПО - это беспланая программа на ПК
#
# 2) У всех ли бесплатных программ открытый исходный код? А если нет, то в чем
# разница.
# Нет не у всех, так как и можно использовать бесплатно, но
# распростронять по своему усмотрению нельзя или изменять
# Пример: WinRar
#
# 3) Python поддерживает динамическую типизацию. Что это такое?
# Динамическая типизация - это когда тип переменной определяется сам
# в ходе исполнения программы, а не на этапе компиляции
#
# 4) Назовите 5 самых популярных языков программирования для специалистов по
# анализу данных
# Python, R, Java, SQL, C++
#
# 5) В чем заключается преимущество Python по сравнению с языком С?
# Он простой, более востребован, и на нем написано много
# удобных библиотек
#
# 6) Python портативен. Что в этом контексте означает «портативность»?
# Это значит, что один и тот же код можно запускать на разных ОС
#
# 7) В чем разница между «расширяемым» и «встраиваемым» языком?
#
# Расширяемый — можно расширять язык внешним кодом.
# Встраиваемый — можно встроить сам язык в другую программу.
#
# 8) В чем смысл IDE? Чем она отличается от командной строки?
# IDE - среда разработки, с удобными инструментами.
# Командная строка - минимальный интерфейс для запуска команд
#
# 9) Как открыть существующий документ Jupyter Notebook?
# Чем эта процедура от­ личается от открытия РDF-файла
# или текстового файла?
#
# Для Jupyter Notebook - нужен запущенный Jupyter-сервер
#
# 10) В чем разница между «ячейками разметки Markdown» и «ячейками кода»
# в Jupyter Notebook? Для чего они нужны?
#
# Markdown - обычный текс
# Ячейки кода - место для написания кода
#

# 2.12.2. Правда или ложь
# 1) Ложь
# 2) Правда
# 3) Ложь
# 4) Ложь
# 5) Правда
# 6) Правда
# 7) Ложь
# 8) Правда
# 9) Правда
# 10) Ложь

# 2.13.2 - Сделал
