"""Упражения."""

# ## 1.5.1
# 1) Какие предметные области входят в Data Science?
# Что между ними общего и в чем различие?
# В DS входят - математика, статистика, алгоритмы, сбор данных,
# программная инженерия. Общее то, что сбором данных и
# математикой/статистикой/алгоритмами занимается аналитик данных,
# а программной инженерией, математик и т.д. занимается дата инженер
#
# 2) Как вы понимаете термин «алгоритм»?Как алгоритмы связаны с блок-схемами?
# Алгоритм - это последовательность выполнение каких-либо действий/команд.Блок-схема
# это ранний способо представить визуально алгоритм
#
# 3) Какую программу можно назвать хорошей? Запишите все характеристики, какие удастся придумать.
# Я думаю, что программу можно назвать хорошей, если она организована для пользователей,
# устройств, разработчиков. Характеристики: реализован весь функционал, безопасность,
# оптимизация под разные платформы/версии устройств, совместимость.
#
# 4)  Какой язык понимает компьютер?
# Он понимает машинный код(двоичный)
#
# 5) Чем языки программирования отличаются от языков, на которых мы говорим?
# Языки на которых мы говорим, не понимает ПК, также ЯП имеют строгую типизацию,
# синтаксис и предназначен для написания "команд для ПК".
#
# ## 1.5.2
# 1) Машинное обучение-это инструмент для извлечения знаний из данных.
# Правда
#
# 2) Глубокое обучение-это то же самое,что машинное обучение.
# Ложь
#
# 3) Всеи нженеры-программисты также могут считаться специалистами по данным.
# Ложь
#
# 4) Статистика-важный инструмент для специалистов по данным.
# Правда
#
# 5) Компьютер может принимать решения, выходящие за рамки данных ему инструкций,
# подстраиваясь под изменения среды.
# Ложь
#
# 6) Компьютеры понимают языки программирования «как есть».
# Ложь
#
# 7) Некоторые языки программирования компилируются,
# некоторые интерпрети­руются, а некоторые используют и то и другое.
# Правда
#
# 8) Все программы выполняются последовательно
# Ложь
#
# 9) В IDE есть встроенный текстовый редактор.
# Правда
#
# 10) Компиляторы и интерпретаторы - это такие механизмы,
# наподобие привода для компакт-дисков.
# Ложь
#
#

# ## 1.5.3
# 1) Напишите алгоритм для расчета простых процентов от некоторой суммы.
# Начало
# Ввести сумму a
# Ввести процент b
# Ввести время c
# итого = (a * b * c) / 100
# Вывод итог
# Конец
#
# 2) Напишите алгоритм для вычисления площади прямоугольника.
# Начало
# Ввести ширина w
# Ввести длину l
# s = w * h
# Вывод s
# Конец
#
# 3) Напишите алгоритм вычисления периметра круга.
# Начало
# Ввести радиус или диаметр r/d
# Если радиус p = 2 * pi * r
# Если диаметр p = pi * d
# Вывод p
# Конец
#
# 4) Напишите алгоритм,который находит все простые числа меньше 100
# Начало
# Пока i находится в диапозоне от 0 до 100:
#     Вывод каждого числа через 1
# Конец
#
# 5) Напишите алгоритм превращения предложения,
# написанного в верхнем регист­ре, в обычный для предложений регистр.
# Начало
# Ввеcти s
# Преобразовать s в строку
# Первая буква s в верхний регистр + остальные буквы s
# Вывод s
# Конец
#
# 6) Составьте блок-схему приготовления льда из кипяченой воды с помощью холо­дильника.
# ![image.png](attachment:image.png)
#
# 7) Составьте блок-схему для нахождения суммы всех четных чисел меньше ста.
# ![image-2.png](attachment:image-2.png)
#
# 8) Составьте блок-схему для вычисления квадрата
# всех нечетных чисел от 1 до 15 включительно.
# ![image-3.png](attachment:image-3.png)
#
# 9) Составьте блок-схему вывода таблицы умножения на 3.
# ![image-4.png](attachment:image-4.png)
#
# 10) Составьте блок-схему для расчета сложных процентов (с капитализацией).
# ![image-5.png](attachment:image-5.png)
#
# ## 1.5.4
# 1)  Что думают ученые о будущем Data Science?
# Изучите материалы на эту тему и поделитесь ими с друзьями.
# Ученные считают, что DS связан с интеграцией во многие прикалдыне сферы
# человека(автоматизация на заводах, помощь в медецине, работа в опсаных местах)
#
# 2) Составьте список разных IDE для языка Python. Узнайте, чем они похожи и чем отличаются.
# PyCharm, VScode, Jupyter Notebook
# PyCharm - требует много ресурсов ПК, подходит для больших проектов,
# Имеет отладку, тестирование, работа с Git
#
# VScode - легкий/расширяемый, поддержка Python, бесплатный,
# быстро работает, подходит и для маленьких проектов,
# меньше встроенных инструментов
#
# Jupyter Notebook - удобен для анализа данных, визуализации, обучения,
# может работать даже в браузере, не подходит для больших проектов
#
# 3) Составьте список всех компилируемых и интерпретируемых языков.
# Найдите ситуации, в которых каждый из них будет полезнее в использовании, чем остальные.
# Компилируемые: C, C++, C#, Rust, Go, Swift, Fortran
# Интерпретируемые: Python, JS, PHP, Ruby
# Компилируемые - когда нужна скорость и производительность(игры, драйвера)
# Интерпретируемые - когда нужна простота и гибкость(скрипты, веб-разработка,
# анализ данных)
#
# 4) Создайте алгоритмы для решения некоторых распространенных задач,
# с кото­рыми вы сталкиваетесь в повседневной жизни.
# Составьте для них блок-схемы.
# ![image-6.png](attachment:image-6.png)
#
# 5) Как вы думаете, может ли изучение компьютерного программирования
# помочь автоматизировать какие-нибудь повторяющиеся рутинные задачи?
# Подготовьте список таких задач и попробуйте
# автоматизировать их по мере изучения этой книги.
# Может помочь, и помогает в таких задачах как:
# Работа с файлами, работа с текстом, обработка данных,
# учеба и анализ
#
