"""Opensource issue."""

# 1. Есть ли у него лицензия? Обычно в корне репозитория находится
# файл LICENSE.
# Да, есть
#
# 2. Напишите название понравившейся компании и ссылку на репозиторий
# Google
#
# 3. Проект активно принимает стороннюю помощь?
# Да
#
# 4. Напишите второе улучшение которое вы сделали
# Исправил опечатку в названии переменной
# https://github.com/googleapis/google-api-nodejs-client/pull/3789
#
# 5. Посмотрите на коммиты в основной ветке, напишите общее количество
# 10244
#
# 6. Когда был последний коммит?
# Sep 18, 2025
#
# 7. Сколько контрибьюторов у проекта?
# 143
#
# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно,
# кликнув по ссылке «Commits» в верхней панели.)
# Примерно по 10-15 раз в месяц
#
# 9. Сколько сейчас открытых ишью?
# 210
#
# 10. Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
# Примерно 1-2 недели
#
# 11. Ведётся ли активное обсуждение ишью?
# В каждом ишью 2-20 комментариев
#
# 12. Есть ли недавно созданные ишью?
# Да, не считая меня 5 дней назад было создано еще одно
#
# 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на
# вкладку «Closed», чтобы увидеть закрытые ишью.)
# Да, 1559
#
# 14. Сколько сейчас открытых пул-реквестов?
# 5
#
# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
# Да, вполне, 5-7 дней до закрытия или хотя бы начала обсуждения
#
# 16. Ведётся ли активное обсуждение пул-реквестов?
# Да
#
# 17. Есть ли недавно отправленные пул-реквесты?
# Да, на прошлой неделе
#
# 18. Как давно были объединены пул-реквесты? (На странице Pull
# Request GitHub-репозитория
# щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
# На прошлой неделе
#
# https://github.com/googleapis/google-api-nodejs-client/issues/3787 - ишью
# https://github.com/googleapis/google-api-nodejs-client/pull/3788 - пулл к гуглу
#
