"""27.10.2025."""

# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
# есть. MIT
#
# 2. Напишите название понравившейся компании и ссылку на репозиторий
# Python-World
# https://github.com/NirShaharabani/python-mini-projects
#
# 3. Проект активно принимает стороннюю помощь?
# в целом, да
#
# 4. Напишите второе улучшение которое вы сделали
# исправил опечатки в README
#
# 5. Посмотрите на коммиты в основной ветке, напишите общее количество
# 987
#
# 6. Когда был последний коммит?
# 14.10.2025
#
# 7. Сколько контрибьюторов у проекта?
# у основы 123
#
# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
# раньше было довольно часто, сейчас очень мало
#
# 9.  Сколько сейчас открытых ишью?
# 60
#
# 10. Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
# не очень
#
# 11. Ведётся ли активное обсуждение ишью?
# мало
#
# 12. Есть ли недавно созданные ишью?
# да
#
# 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
# да
#
# 14. Сколько сейчас открытых пул-реквестов?
# 8
#
# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
# не очень
#
# 16. Ведётся ли активное обсуждение пул-реквестов?
# мало обсуждений
#
# 17. Есть ли недавно отправленные пул-реквесты?
# нет
#
# 18. Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
# давно
#
