"""Opensource."""

# 1) Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
#
# Да
#
# 2) Напишите название понравившейся компании и ссылку на репозиторий
#
# Microsoft, https://github.com/microsoft/vscode
#
# 3) Проект активно принимает стороннюю помощь?
#
# Да
#
# 4) Напишите второе улучшение которое вы сделали
#
# Попросил написать файл LICENSE.txt читабельнее
#
# 5) Посмотрите на коммиты в основной ветке, напишите общее количество
#
# 138,646
#
# 6) Когда был последний коммит?
#
# 11 часов назад
#
# 7) Сколько контрибьюторов у проекта?
#
# 2,275
#
# 8) Как часто люди коммитят в репозиторий?
#
# 200-300 в месяц
#
# 9) Сколько сейчас открытых ишью?
#
# 5+тыс
#
# 10) Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
#
# Да
#
# 11) Ведётся ли активное обсуждение ишью?
#
# Активного прям нет, но комменты присутвуют немного
#
# 12) Есть ли недавно созданные ишью?
#
# Да
#
# 13) Есть ли закрытые ишью?
#
# Да - 197 671
#
# 14) Сколько сейчас открытых пул-реквестов?
#
# 795
#
# 15) Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
#
# За октябрь 2025 где-то 2-3 дня среднее
#
# 16) Ведётся ли активное обсуждение пул-реквестов?
#
# Да
#
# 17) Есть ли недавно отправленные пул-реквесты?
#
# Да, 9 часов назад, до меня
#
# 18) Как давно были объединены пул-реквесты?
#
# Какие-то 1 день назад, самый ближайший 12 часов назад

#
