"""[TASK] Контрибьютинг в Open Source  #8."""

# Проект в который вы отправили пул реквест, попадает под определение опенсорса:
#
# Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
#     - Да
# Напишите название понравившейся компании и ссылку на репозиторий
#     - https://github.com/Shailaja-poojari/hacktoberfest-2025
# Проект активно принимает стороннюю помощь?
#     - Да
# Напишите второе улучшение которое вы сделали
#     - Исправил опечатку в коде
#     - Два изменения в одном PR: Shailaja-poojari/hacktoberfest-2025#48
# Посмотрите на коммиты в основной ветке, напишите общее количество
#     - 27
# Когда был последний коммит?
#     - 12.11.25
# Сколько контрибьюторов у проекта?
#     - 6
# Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
#     - в среднем 3 коммита в месяц
# Сколько сейчас открытых ишью?
#     - 7
# Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
#     - Нет
# Ведётся ли активное обсуждение ишью?
#     - Да
# Есть ли недавно созданные ишью?
#     - Да
# Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
#     - Да
# Сколько сейчас открытых пул-реквестов?
#     - 13
# Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
#     - Да
# Ведётся ли активное обсуждение пул-реквестов?
#     - Нет
# Есть ли недавно отправленные пул-реквесты?
#     - Да
# Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
#     - 12 часов
# Firstcontributions: firstcontributions/first-contributions#107001
