"""Ответы на вопросы по Open-source проектам."""

# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
#
# Да, у проекта есть лицензия - Apache License.

# 2. Напишите название понравившейся компании и ссылку на репозиторий
#
# Компания: Canonical Ltd.
#
# Ссылка на репозиторий: https://github.com/canonical/github-runner-operator

# 3. Проект активно принимает стороннюю помощь?
#
# Проект активно принимает стороннюю помощь. Судя по закрытым Issue и Pull requests, компания регулярно вносит изменения, поддерживая активное взаимодействие с сообществом. Улучшения и обновления происходят достаточно часто (в среднем - 1-2 раза в неделю), что свидетельствует об открытости к внешним вкладчикам.

# 4. Напишите второе улучшение которое вы сделали
#
# Таким улучшением является добавление комментариев с динамическим содержимым, особенно с состоянием pull request или статусом сборки/тестов. Это улучшение значительно повышает ценность процесса автоматизации работы с pull requests.

# 5. Посмотрите на коммиты в основной ветке, напишите общее количество
#
# Общее количество коммитов - 339.

# 6. Когда был последний коммит?
#
# 20 февраля 2025 г.

# 7. Сколько контрибьюторов у проекта?
#
# 27 контрибьюторов.

# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
#
# Относительно часто.

# 9. Сколько сейчас открытых ишью?
#
# Всего 8 открытых ишью.

# 10. Быстро ли мейнтейнеры реагируют на ишьюс после того, когда они открываются?
#
# Достаточно быстро.

# 11. Ведётся ли активное обсуждение ишьюс?
#
# Да, ишьюсы в данном проекте активно обсуждаются.

# 12. Есть ли недавно созданные ишью?
#
# Да, последние 2 ишьюса созданы мной.

# 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
#
# Да, и всего 26 таких ишьюс.

# 14. Сколько сейчас открытых пул-реквестов?
#
# Всего 17 открытых pull requests.

# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
#
# Относительно быстро.

# 16. Ведётся ли активное обсуждение пул-реквестов?
#
# Да, ведётся.

# 17. Есть ли недавно отправленные пул-реквесты?
#
# Таких нету.

# 18. Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
#
# 20 февраля 2025 г.
