"""Opensource Contributing Quiz."""

# #Проект в который вы отправили пул реквест, попадает под определение опенсорса:
#
# Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
# #
# Напишите название понравившейся компании и ссылку на репозиторий
# #
# Проект активно принимает стороннюю помощь?
# Напишите второе улучшение которое вы сделали
# Посмотрите на коммиты в основной ветке, напишите общее количество
# #
# Когда был последний коммит?
# #
# Сколько контрибьюторов у проекта?
# #
# Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
# #
# Сколько сейчас открытых ишью?
# #
# Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
# #
# Ведётся ли активное обсуждение ишью?
# #
# Есть ли недавно созданные ишью?
# #
# Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
# #
# Сколько сейчас открытых пул-реквестов?
# #
# Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
# #
# Ведётся ли активное обсуждение пул-реквестов?
# #
# Есть ли недавно отправленные пул-реквесты?
# #
# Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
# #
