# %%
"""opensource."""

# %% [markdown]
# ### 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
# Есть
#
# ### 2. Напишите название понравившейся компании и ссылку на репозиторий
# Google. Ссылка: https://github.com/google/timesketch
#
# ### 3. Проект активно принимает стороннюю помощь?
# 134 Contributors и есть свежие issue
#
# ### 4. Напишите второе улучшение которое вы сделали
# Поправил README.md
#
# ### 5. Посмотрите на коммиты в основной ветке, напишите общее количество
# Более 3500 коммитов
#
# ### 6. Когда был последний коммит?
# На момент написания ответа последний коммит был 4 дня назад (07.08.2025)
#
# ### 7. Сколько контрибьюторов у проекта?
# 134
#
# ### 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
# Регулярно. Коммиты идут несколько раз в неделю. Бывают дни, когда сразу много коммитов.
#
# ### 9. Сколько сейчас открытых ишью?
# 210
#
# ### 10. Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
# Есть как свежие issue, так и старые. При этом закрыто более 1к issues.
#
# ### 11. Ведётся ли активное обсуждение ишью?
# Более половины issues с комментариями
#
# ### 12. Есть ли недавно созданные ишью?
# Да
#
# ### 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
# Да
#
# ### 14. Сколько сейчас открытых пул-реквестов?
# 9
#
# ### 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
# Самому свежему открытому PR 2 недели. При этом есть PR, закрытые 4-5 дней назад.
#
# ### 16. Ведётся ли активное обсуждение пул-реквестов?
# Подавляющая часть PR имеет комментарии.
#
# ### 17. Есть ли недавно отправленные пул-реквесты?
# Да
#
# # 18. Как давно были объединены пул-реквесты?
# 4 дня назад, когда были последние коммиты.
