# %%
"""Ответы на вопросы."""

# Проект в который вы отправили пул реквест, попадает под определение опенсорса:
# Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
# Ответ: да, Apache License.
# Напишите название понравившейся компании и ссылку на репозиторий
# Ответ: Yandex CatBoost, ссылка на репозиторий: https://github.com/catboost/catboost
# Проект активно принимает стороннюю помощь?
# Ответ: да
# Напишите второе улучшение которое вы сделали.
# Ответ: исправила описание в файле README.
# Посмотрите на коммиты в основной ветке, напишите общее количество
# Ответ: 50 274 коммита по состоянию на 7.03.2026г.
# Когда был последний коммит?
# Ответ: последний коммит был 5 марта 2026 года
#
# Сколько контрибьюторов у проекта?
# Ответ: 401
# Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
# Ответ: часто, каждую неделю
#
# Сколько сейчас открытых ишью?
# Ответ: 654
# Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
# Ответ: да
# Ведётся ли активное обсуждение ишью?
# Ответ: обсуждение есть, 1-3 человека комментируют.
# Есть ли недавно созданные ишью?
# Ответ:  последнее issue было создано на прошлой неделе.
# Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
# Ответ: сейчас 1871 закрытых ишью.
# Сколько сейчас открытых пул-реквестов?
# Ответ: 28
# Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
# Ответ: да, в тот же день
# Ведётся ли активное обсуждение пул-реквестов?
# Ответ:
# Есть ли недавно отправленные пул-реквесты?
# Ответ: да
# Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
# Ответ: 4 марта 2026
#
