"""Opensource Contributing Quiz."""

# #Проект в который вы отправили пул реквест, попадает под определение опенсорса:
# да
# Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
# #да
# Напишите название понравившейся компании и ссылку на репозиторий
# #first-contributions(https://github.com/firstcontributions)
# Проект активно принимает стороннюю помощь?
# да
# Напишите второе улучшение которое вы сделали
# #исправил ридми файл внём не отображились иконки и сделал ревью в документе на синтаксические ошибки
# Посмотрите на коммиты в основной ветке, напишите общее количество
# #10,932
# Когда был последний коммит?
# #22:20
# Сколько контрибьюторов у проекта?
# #5,000
# Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
# #очень активно
# Сколько сейчас открытых ишью?
# #26
# Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
# #да
# Ведётся ли активное обсуждение ишью?
# #да
# Есть ли недавно созданные ишью?
# #много
# Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
# 916 closed
# Сколько сейчас открытых пул-реквестов?
# #82
# Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
# #да
# Ведётся ли активное обсуждение пул-реквестов?
# #да
# Есть ли недавно отправленные пул-реквесты?
# #да
# Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
# #24 минут назад(22:10)
