"""Ответы на вопросы по Open-source проектам."""

# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
#
# Да, у проекта есть лицензия - MIT License.

# 2. Напишите название понравившейся компании и ссылку на репозиторий
#
# Компания: first-contributions. 
#
# Ссылка на репозиторий: https://github.com/firstcontributions/first-contributions

# 3. Проект активно принимает стороннюю помощь?
#
# Проект активно принимает стороннюю помощь. 
# Говоря языком цифр:
# - 33 открытых и 846 закрытых issue, 
# 118 открытых и 95 064 закрытых pull request.

# 4. Напишите второе улучшение которое вы сделали
#
# Таким улучшением является добавление специальных бирок (badges) - образцы указаны в файле README.md. Это улучшение делает статус проекта более понятным с первого взгляда, позволяя понимать текущее состояние разных его частей.

# 5. Посмотрите на коммиты в основной ветке, напишите общее количество
#
# Общее количество коммитов - 3 459.

# 6. Когда был последний коммит?
#
# 10 апреля 2025 г.

# 7. Сколько контрибьюторов у проекта?
#
# Более 5000

# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
#
# В среднем ежедневно по 10+ коммитов

# 9. Сколько сейчас открытых ишью?
#
# Всего 33 открытых ишью. 

# 10. Быстро ли мейнтейнеры реагируют на ишьюс после того, когда они открываются?
#
# Достаточно быстро, на протяжении нескольких дней.

# 11. Ведётся ли активное обсуждение ишьюс?
#
# Да, ишьюсы в данном проекте активно обсуждаются.

# 12. Есть ли недавно созданные ишью?
#
# Да, последний ишью создан мной.

# 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
#
# Да, и всего 846 таких ишьюс.

# 14. Сколько сейчас открытых пул-реквестов?
#
# Всего 118 открытых pull requests.

# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
#
# Относительно быстро, в течение нескольких часов после открытия.

# 16. Ведётся ли активное обсуждение пул-реквестов?
#
# Да, ведётся.

# 17. Есть ли недавно отправленные пул-реквесты?
#
# Да, такой пул-реквест был выполнен мной.

#

# 18. Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
#
# 10 апреля 2025 г.
