"""Разбираем проект с Open-Source."""

# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
#
# Да. В корне репозитория находится файл LICENSE, используется лицензия MIT.
#
# 2. Напишите название понравившейся компании и ссылку на репозиторий
#
# - Компания: Stepik (StepicOrg)
#
# - Репозиторий: https://github.com/StepicOrg/Stepik-API
#
# 3. Проект активно принимает стороннюю помощь?
#
# Сейчас уже не очень, но в репозитории есть файл CONTRIBUTING.md, открыты Issues и Pull Requests, а также принимаются внешние контрибьюции через fork и PR.
#
# 4. Напишите второе улучшение которое вы сделали
#
# Я исправил документацию в README.md: исправил опечатки и улучшил примеры JSON/описание API (улучшение документации).
#
# 5. Посмотрите на коммиты в основной ветке, напишите общее количество
#
# 191 коммит в основной ветке master.
#
# 6. Когда был последний коммит?
#
# 4 года назад
#
# 7. Сколько контрибьюторов у проекта?
#
# 32 контрибьютера.
#
# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
#
# Сейчас уже не часто. В последний раз commit был в 2022 году.
#
# 9. Сколько сейчас открытых ишью?
#
# 5 открытых issue.
#
# 10. Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
#
# Не очень.
#
# 11. Ведётся ли активное обсуждение ишью?
#
# Нет.
#
# 12. Есть ли недавно созданные ишью?
#
# Последний созданный issue (кроме моего) был в 2024 году.
#
# 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
#
# Да, есть 3 закрытых issue.
#
# 14. Сколько сейчас открытых пул-реквестов?
#
# 2 открытых pull-request'а.
#
# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
#
# Нет, долго.
#
# 16.Ведётся ли активное обсуждение пул-реквестов?
#
# Нет.
#
# 17. Есть ли недавно отправленные пул-реквесты?
#
# Нет.
#
# 18. Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
#
# Последний в 2024 году.
