"""[TASK] Контрибьютинг в Open Source."""

# Проект в который вы отправили пул реквест, попадает под определение опенсорса:
# Да
#
# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
# Есть. GNU AFFERO GENERAL PUBLIC LICENSE
#
# 2. Напишите название понравившейся компании и ссылку на репозиторий
# hexlet
# https://github.com/hexlet-basics/exercises-python
#
# 3. Проект активно принимает стороннюю помощь?
# Да
#
# 4. Напишите второе улучшение которое вы сделали
# Убраны опечатки в README
#
# 5. Посмотрите на коммиты в основной ветке, напишите общее количество
# 1087
#
# 6. Когда был последний коммит?
# Вчера
#
# 7. Сколько контрибьюторов у проекта?
# 90
#
# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
# Около 10 коммитов в месяц
#
# 9. Сколько сейчас открытых ишью?
# 1
#
# 10. Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
# Да, 1-2 дня
#
# 11. Ведётся ли активное обсуждение ишью?
# Да
#
# 12. Есть ли недавно созданные ишью?
# Да
#
# 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
# Да
#
# 14. Сколько сейчас открытых пул-реквестов?
# 1
#
# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
# Да, 1-2 дня
#
# 16. Ведётся ли активное обсуждение пул-реквестов?
# Да
#
# 17. Есть ли недавно отправленные пул-реквесты?
# Да
#
# 18. Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
# Вчера
#
