"""This notebook contains my answers to the questions."""

# Проект в который вы отправили пул реквест, попадает под определение
# опенсорса:
#
# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл
# LICENSE.
# Ответ: есть
# 2. Напишите название понравившейся компании и ссылку на репозиторий
# Ответ: Hugging Face https://github.com/huggingface/transformers
# 3. Проект активно принимает стороннюю помощь?
# Ответ: Да, есть CONTRIBUTING.md, 1065 открытых ишьюсов на момент 29.06.2025,
# 16500 закрытых, 785 пулреквестов, И 20227!!! ЗАКРЫТЫХ пулреквестов.
# 4. Напишите второе улучшение которое вы сделали
# Ответ: Исправил грамматическую ошибку в файле awesome-transformers.md
# 5. Посмотрите на коммиты в основной ветке, напишите общее количество
# Ответ: 19468 commits
# 6. Когда был последний коммит?
# Ответ: вчера
# 7. Сколько контрибьюторов у проекта?
# Ответ: 3262
# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно,
# кликнув по ссылке «Commits» в верхней панели.)
# Ответ: зависит от дня недели, в будние дни в среднем около 18 коммитов
# 9. Сколько сейчас открытых ишью?
# Ответ: 1065
# 10. Быстро ли мейнтейнеры реагируют на ишью после того, когда они
# открываются?
# Ответ: В будние дни ответы в течении 2-3 часов
# 11. Ведётся ли активное обсуждение ишью?
# Ответ: да
# 12. Есть ли недавно созданные ишью?
# Ответ: много
# 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните
# на вкладку «Closed», чтобы увидеть закрытые ишью.)
# Ответ: 16500 закрытых
# 14. Сколько сейчас открытых пул-реквестов?
# Ответ: 785
# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
# Ответ: Очень быстро, от 3 минут до получаса в будние дни
# 16. Ведётся ли активное обсуждение пул-реквестов?
# Ответ: да
# 17. Есть ли недавно отправленные пул-реквесты?
# Ответ: да
# 18. Как давно были объединены пул-реквесты? (На странице Pull Request
# GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые
# пул-реквесты.)
# Ответ: вчера (всего один т.к. суббота)
