"""Contributing to the project."""

# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE. да
# 2. Напишите название понравившейся компании и ссылку на репозиторий google https://github.com/google/ml-metrics/blob/main/LICENSE
# 3. Проект активно принимает стороннюю помощь? Нет, он не широко известный, всего 4 человека создавали пул-реквесты включая меня и бота
# 4. Напишите второе улучшение которое вы сделали: исправил опечатку в коде при выводе ошибки
# 5. Посмотрите на коммиты в основной ветке, напишите общее количество: 716
# 6. Когда был последний коммит? 19 часов назад
# 7. Сколько контрибьюторов у проекта? 7
# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.) Не слишком часто, в последние месяцы по 0-3 коммита, хотя есть и чуть более насыщенные, например апрель: 6 коммитов.
# 9. Сколько сейчас открытых ишью? 1
# 10. Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются? не очень, на данный момент прошло около 5-6 часов, но никто не ответил, мой ишьюс первый
# 11. Ведётся ли активное обсуждение ишью? нет
# 12. Есть ли недавно созданные ишью? только мой
# 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.) нет
# 14. Сколько сейчас открытых пул-реквестов? 8
# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия? в целом да
# 16. Ведётся ли активное обсуждение пул-реквестов? редко
# 17. Есть ли недавно отправленные пул-реквесты? да
# 18. Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.) 19 часов назад (на момент написания этого ноутбука)
