# Проект в который вы отправили пул реквест, попадает под определение опенсорса:
#
# Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
#
#         yes
# Напишите название понравившейся компании и ссылку на репозиторий
#
#         https://github.com/OpenDroneMap/WebODM
#
# Проект активно принимает стороннюю помощь?
#
#     да, быстро отвечает
#
# Напишите второе улучшение которое вы сделали
#
#     fix typo in Readme file
#
# Посмотрите на коммиты в основной ветке, напишите общее количество
#
#         2832
#
# Когда был последний коммит?
#
#     13 hours ago
# Сколько контрибьюторов у проекта?
#
#     93
#
# Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
#
#     every day
#
# Сколько сейчас открытых ишью?
#
#     58
#
# Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
#
#     в течении суток
#
# Ведётся ли активное обсуждение ишью?
#
#     комментируют активно
#
# Есть ли недавно созданные ишью?
#
#     да 13 ч назад
#
# Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
#
#     да 1013
#
# Сколько сейчас открытых пул-реквестов?
#
#     2
# Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
#
#     да
#
# Ведётся ли активное обсуждение пул-реквестов?
#
#     да, если закывают то объясняют причину
#
# Есть ли недавно отправленные пул-реквесты?
#
#     13 hours ago
#
# Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть 
# закрытые пул-реквесты.)
#
#     13 hours ago