"""opensource."""

# # Проект в который вы отправили пул реквест, попадает под определение опенсорса:
#
# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
# - Да
# 2. Напишите название понравившейся компании и ссылку на репозиторий
# - Google, https://github.com/google/ml-edu
# 3. Проект активно принимает стороннюю помощь?
# - Не очень, у данного репозитория всего 11 пул реквестов
# 4. Напишите второе улучшение которое вы сделали
# - Обновил README, сделал его более информативным и содержательным
# 5. Посмотрите на коммиты в основной ветке, напишите общее количество
# - 11
# 6. Когда был последний коммит?
# - 2 месяца назад
# 7. Сколько контрибьюторов у проекта?
# - 2
# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
# - В среднем раз в 2-3 месяца
# 9. Сколько сейчас открытых ишью?
# - 2
# 10. Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
# - Нет
# 11. Ведётся ли активное обсуждение ишью?
# - Нет
# 12. Есть ли недавно созданные ишью?
# - Нет
# 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
# - Нет
# 14. Сколько сейчас открытых пул-реквестов?
# - 2
# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
# - Да
# 16. Ведётся ли активное обсуждение пул-реквестов?
# - Нет
# 17. Есть ли недавно отправленные пул-реквесты?
# - Да
# 18. Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
# - Месяц назад
#
