"""Open-source проекты."""

<<<<<<< HEAD
# ## Список вопросов и ответов по теме open-source
#
# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
#
# Да, в обоих проектах, в которых я создала issue и сделала pull request есть лицензия.
#
# 2. Напишите название понравившейся компании и ссылку на репозиторий
#
# Я выбрала эту - qxresearch AI. Ссылка на их репо - https://github.com/qxresearch/qxresearch-event-1.
#
# 3. Проект активно принимает стороннюю помощь?
#
# Просмотрев закрытые Issue и Pull requests я могу сделать вывод, что компания не очень активно принимает стороннюю помощь. Изменения вносятся раз в несколько месяцев.
#
# 4. Напишите второе улучшение которое вы сделали
#
# Вторым улучшением я исправила им неактивную ссылку, которая вела на проект в их же репозитории. Там была опечатка в одной букве.
#
# 5. Посмотрите на коммиты в основной ветке, напишите общее количество
#
# Всего 185 коммитов.
#
# 6. Когда был последний коммит?
#
# В мае 2024.
#
# 7. Сколько контрибьюторов у проекта?
#
# 27 контрибьюторов.
#
# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
#
# Достаточно редко.
#
# 9. Сколько сейчас открытых ишьюс?
#
# 3 открытых issues.
#
# 10. Быстро ли мейнтейнеры реагируют на ишьюс после того, когда они открываются?
#
# Нет, не быстро.
#
# 11. Ведётся ли активное обсуждение ишьюс?
#
# Нет, в этом проекте не ведется.
#
# 12. Есть ли недавно созданные ишьюс?
#
# Да, и это 2 моих.
#
# 13. Есть ли закрытые ишьюс? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишьюс.)
#
# Есть закрытые ишьюс, их 6.
#
# 14. Сколько сейчас открытых пул-реквестов?
#
# 17 открытых pull requests.
#
# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
#
# Нет, не быстро.
#
# 16. Ведётся ли активное обсуждение пул-реквестов?
#
# Нет, не ведется.
#
# 17. Есть ли недавно отправленные пул-реквесты?
#
# Да, я недавно отправила pull request на исправление опечаток в строке кода и в ссылке в файле README.
#
# 18. Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
#
# Последний объединенный пул реквест был в октябре 2024.
