# %%
"""Issue Open Source."""

# 1) Есть ли у него лицензия? Обычно в корне репозитория находится файл
# LICENSE.
# Да
# 2) Напишите название понравившейся компании и ссылку на репозиторий
# https://github.com/pypa/sampleproject
# 3) Проект активно принимает стороннюю помощь?
# Судя по наличию issues и pull requests, да, проект принимает внешний вклад
# 4) Напишите второе улучшение которое вы сделали
# Добавил в файл README.md Additionally: adhere to [PEP8]
# (https://peps.python.org/pep-0008/) when writing code.
# 5) Посмотрите на коммиты в основной ветке, напишите общее количество
# 197
# 6) Когда был последний коммит?
# 10 месяцев назад
# 7) Сколько контрибьюторов у проекта?
# 54
# 8) Как часто люди коммитят в репозиторий? (На GitHub выяснить
# это можно, # кликнув по ссылке «Commits» в верхней панели.)
# Раз в 3-6 месяцев
# 9) Сколько сейчас открытых ишью?
# 16
# 10) Быстро ли мейнтейнеры реагируют на ишью после того,
# когда они открываются?
# Не очень
# 11) Ведётся ли активное обсуждение ишью?
# Среднее
# 12) Есть ли недавно созданные ишью?
# Да,неделю назад
# 13) Есть ли закрытые ишью? (На странице Issues GitHub-репозитория
# щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
# Да. 81 ишью закрыт
# 14) Сколько сейчас открытых пул-реквестов?
# 5
# 15) Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
# Около месяца
# 16) Ведётся ли активное обсуждение пул-реквестов?
# от 3-39 комментариев
# 17) Есть ли недавно отправленные пул-реквесты?
# 3 месяца назад (не считая моего)
# 18) Как давно были объединены пул-реквесты?
# (На странице Pull Request GitHub-репозитория
# щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
# Меньше года назад
#
