"""Open source инфа."""

# Проект в который вы отправили пул реквест, попадает под определение опенсорса:
#
# Ответ:
#
# https://github.com/google-research/language
#
# Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
#
# Ответ:
#
# Да
#
# Напишите название понравившейся компании и ссылку на репозиторий
#
# Ответ:
#
# Google
#
# Проект активно принимает стороннюю помощь?
#
#
# Ответ:
#
# Да
#
# Напишите второе улучшение которое вы сделали
#
#
# Ответ:
#
# Поправил ошибки заголовке модуля
# https://github.com/google-research/language/pull/239/changes
#
#
# Посмотрите на коммиты в основной ветке, напишите общее количество
#
# Ответ:
#
# 147
#
# Когда был последний коммит?
#
# Ответ:
#
# Commits on Oct 17, 2024
#
# Сколько контрибьюторов у проекта?
#
# Ответ: 11
#
# Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
#
# Ответ: раз в год
#
# Сколько сейчас открытых ишью?
#
# Ответ: 78
#
# Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
#
# Ответ:
#
# в течение 2 месяцев
#
# Ведётся ли активное обсуждение ишью?
#
# Ответ:
#
# Нет
#
# Есть ли недавно созданные ишью?
#
# Ответ:
#
# месяц назад
#
# Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
#
# Ответ:
#
# Да
#
# Сколько сейчас открытых пул-реквестов?
#
# Ответ:
#
# 38
#
# Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
#
# Ответ:
#
# В течении месяца
#
# Ведётся ли активное обсуждение пул-реквестов?
#
# Ответ:
#
# Нет
#
# Есть ли недавно отправленные пул-реквесты?
#
# Ответ:
#
# Да, 5 дней назад
#
# Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
#
# Ответ:
#
# 2 недели назад
