"""[TASK] Контрибьютинг в Open Source."""

# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
#     - Да
# 2. Напишите название понравившейся компании и ссылку на репозиторий
#     - Met Office
#     - https://github.com/MetOffice/simulation-systems
# 3. Проект активно принимает стороннюю помощь?
#     - Да
# 4. Напишите второе улучшение которое вы сделали
#     - Избавился от устаревшего фильтра length_is
#     - https://github.com/adams-okode/django-volt-admin/pull/2
# 5. Посмотрите на коммиты в основной ветке, напишите общее количество
#     - 194
# 6. Когда был последний коммит?
#     - Sep 9, 2025
# 7. Сколько контрибьюторов у проекта?
#     - 16
# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
#     - 24 за последний год
# 9. Сколько сейчас открытых ишью?
#     - 12
# 10. Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
#     - Нет
# 11. Ведётся ли активное обсуждение ишью?
#     - Нет
# 12. Есть ли недавно созданные ишью?
#     - Последний ищью был создан 3 недели назад
# 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
#     - Да, есть. 72 закрытых ишью
# 14. Сколько сейчас открытых пул-реквестов?
#     - 3 открытых пул реквестов
# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
#     - Да
# 16. Ведётся ли активное обсуждение пул-реквестов?
#     - Да
# 17. Есть ли недавно отправленные пул-реквесты?
#     - Последний пул-реквесты был добавлен 3 недели назад
# 18. Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
#     - 4 дня назад
