"""Задание по Commits."""

# 1. Опишите своими словами назначение каждого из этих типов коммитов:
# feat, fix, docs, style, refactor, test, build, ci, perf, chore.
#
# feat - добавляем новый функционал (функцию) в наш код, приводит к увеличению minor
# fix - исправляем баг в нашем коде
#
# docs - изменения в документации проекта
# style - изменяют оформление кода, но не затрагивают функционал
# refactor - изменение структуры кода, оптимизация, упрощение логики
# test - добавление или изменение тестов
# build - изменения конфигураций сборки, добавление библиотек
# ci - изменения, связанные с добавлением новых шагов в процесс сборки или тестирования
# perf - улучшение производительности
# chore - изменение мелких задач, которые не подходят под прошлые типы
# Приводят к увеличению patch
#
# 2. Представьте, что вы исправили баг в функции, которая некорректно округляет числа. Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits (используя тип fix).
#
# fix(round): исправлено некорректное округление чисел в функции roundnumber
#
# Исправлена ошибка в функции округления, которая приводила к неправильным результатам при округлении чисел до ближайшего целого. Теперь функция корректно обрабатывает все случаи.
#
# 3. Добавление новой функциональности:
# Допустим, вы реализовали новую функцию generateReport в проекте. Сделайте фиктивный коммит с типом feat, отражающий добавление этой функциональности
#
# feat(report): добавление функции генерации отчетов
#
# Добавлена новая функция generateReport, которая позволяет пользователям создавать отчеты на основе введенных параметров.
#
# 4. Модификация формата кода или стилей:
# Представьте, что вы поправили отступы и форматирование во всём проекте, не меняя логики кода. Сделайте фиктивный коммит с типом style
#
# style: исправлено форматирование и отступы во всем проекте
#
# Исправлено форматирование кода и отступы во всех файлах проекта. Изменения улучшают читаемость кода и поддерживаемость.
#
# 5. Документация и тестирование:
#
# Сделайте фиктивный коммит с типом docs, добавляющий или улучшающий документацию для вашей новой функции.
# Сделайте фиктивный коммит с типом test, добавляющий тесты для этой же функции.
#
# docs(report): добавлена документация для функции generateReport
#
# Добавлена документация, описывающая использование функции generateReport. Включены примеры вызова функции, описание примеров и форматов вывода.
#
# test(report): добавлены тесты для функции generateReport
#
# Добавлены тесты для функции generateReport, описывающие основные сценарии использования, включая проверку на корректность ввода и обработку параметров.
