"""[TASK] Commits."""

# 1. Опишите своими словами назначение каждого из этих типов коммитов:
# feat, fix, docs, style, refactor, test, build, ci, perf, chore.
#
# feat - Добавление новой функции.
# fix - Исправление багa.
# docs - Изменения только в документации.
# style - Изменение стиля кода, не затрагивающее его назначение.
# refactor - Изменение структуры кода, не меняющие его поведения.
# test - Добавление тестов или изменение существующих.
# build - Изменения, затрагивающие сборку системы или внешние зависимости.
# ci - Изменения в CI конфигурации или скриптах.
# perf - Изменения, улучшающие производительность.
# chore - Служебные изменения, не затрагивающие рабочий код.
#
# 2. Представьте, что вы исправили баг в функции, которая некорректно округляет числа. Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits (используя тип fix).
#
# git commit -m "fix: incorrect rounding"
#
# 3. Добавление новой функциональности:
# Допустим, вы реализовали новую функцию generateReport в проекте. Сделайте фиктивный коммит с типом feat, отражающий добавление этой функциональности
#
# git commit -m "feat: add generateReport func"
#
# 4. Модификация формата кода или стилей:
# Представьте, что вы поправили отступы и форматирование во всём проекте, не меняя логики кода. Сделайте фиктивный коммит с типом style
#
# git commit -m "style: fix Indentation and Formatting"
#
# 5. Документация и тестирование:
#
# Сделайте фиктивный коммит с типом docs, добавляющий или улучшающий документацию для вашей новой функции.
#
# git commit -m "docs: add doc for new func"
#
# Сделайте фиктивный коммит с типом test, добавляющий тесты для этой же функции.
#
# git commit -m "test: add tests for new func"
#
