"""[TASK] Commits  #5."""

# 1. Опишите своими словами назначение каждого из этих типов коммитов:
#     - feat - добавление новой функциональности
#     - fix - исправление бага
#     - docs - изменения в документации
#     - style - исправления форматирования кода
#     - refactor - рефакторинг кода без изменения поведения
#     - test - изменения в тестах
#     - build - изменения сборки
#     - ci - настройки ci/cd
#     - perf - оптимизация/производительность
#     - chore - обновление зависимостей, настройка проекта
