"""[TASK] Commits  #5."""

# 1. Опишите своими словами назначение каждого из этих типов коммитов:
#     - feat - добавление новой функциональности
#     - fix - исправление бага
#     - docs - изменения в документации
#     - style - исправления форматирования кода
#     - refactor - рефакторинг кода без изменения поведения
#     - test - изменения в тестах
#     - build - изменения сборки
#     - ci - настройки ci/cd
#     - perf - оптимизация/производительность
#     - chore - обновление зависимостей, настройка проекта
# 2. Представьте, что вы исправили баг в функции, которая некорректно округляет числа. Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits (используя тип fix).
#     - git commit -m "fix: correct rounding logic"
# 3. Добавление новой функциональности:
# Допустим, вы реализовали новую функцию generateReport в проекте. Сделайте фиктивный коммит с типом feat, отражающий добавление этой функциональности
#     - git commit -m "feat: generate report functionality"
# 4. Модификация формата кода или стилей:
# Представьте, что вы поправили отступы и форматирование во всём проекте, не меняя логики кода. Сделайте фиктивный коммит с типом style
#     - git commit -m "style: correct code formatting and indentation"
# 5. Документация и тестирование:
#
# Сделайте фиктивный коммит с типом docs, добавляющий или улучшающий документацию для вашей новой функции.
# Сделайте фиктивный коммит с типом test, добавляющий тесты для этой же функции.
#     - git commit -m "docs: add documentation for generate report function"
#     - git commit -m "test: add test for generate report function"
