"""[TASK] Commits #5."""

# 1. Опишите своими словами назначение каждого из этих типов коммитов:
# feat - добавление нового функционала, fix - исправление бага (ошибки), docs - добавление (обновление) документации, style - стилистические изменения проекта (не влияющие на смысл кода, именно пробелы, точки с запятой, форматирование не css), refactor - переработка и оптимизация кода (не добавляет новых функций и не исправляет баги, больше про читаемость: например разбить функцию на 3 отдельных), test - добавление новых тестов или изменение старых, build - изменения затрагивающие внешние зависимости и систему сборки, ci - изменение конфигурационных файлов и скриптов CI, perf - изменения кода, направленные на производительность (оптимизация ресурсов памяти, время исполнения), chore - обслуживание рутина (в основном длля разрабов, удаление ненужных файлов, обновление зависимостей и вообще то, что не влияет на новые функции и смысл проекта).
#
# 2. Представьте, что вы исправили баг в функции, которая некорректно округляет числа. Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits (используя тип fix).
# fix(math): correct wrong rounding function
#
# 3. Добавление новой функциональности:
# Допустим, вы реализовали новую функцию generateReport в проекте. Сделайте фиктивный коммит с типом feat, отражающий добавление этой функциональности
# feat(generateReport): add report generation
#
# 4. Модификация формата кода или стилей:
# Представьте, что вы поправили отступы и форматирование во всём проекте, не меняя логики кода. Сделайте фиктивный коммит с типом style
# style: adjust indents and format
#
# 5. Документация и тестирование:
#
# Сделайте фиктивный коммит с типом docs, добавляющий или улучшающий документацию для вашей новой функции.
# docs: add generateReport function documentation
#
# Сделайте фиктивный коммит с типом test, добавляющий тесты для этой же функции.
# test: add generateReport function tests
#
#
#
#
#
