"""Про коммиты."""

# 1) Опишите своими словами назначение каждого из этих типов коммитов:
# feat, fix, docs, style, refactor, test, build, ci, perf, chore.
#
# 1.Тип feat - это добавление новой функции в код.
# 2.Тип fix - исправялет баг в коде.
# 3.Тип build - когда изменения произошли в документации.
# 4.Тип style - это изменение, которые не влияют на работу кода, такие как:
# пробелы, знаки препинания
# 5.Тип refactor - это улучшение программы/кода, без изменения его смысла,
# но, делающее его более читаемым, удобным, масштабируемым.Делает код более
# понятным
# 6.Тип test - это добавление новых тестов, либо корректировка/изменение старых
# 7.Тип build - это изменение, которое влияет на внешние системы или на систему сборки
# 8.Тип ci - это изменение в файлах влияющих на автоматизацию, изменение в файлах ci
# 9.Тип perf - это изменение кода, влияющее на его производительность
# 10.Тип chore - это изменения, не влияющие на работу кода, а влияющие на рутинные задачи,
# вспомогательные задачи
#
# 2) Представьте, что вы исправили баг в функции, которая некорректно округляет числа.
# Сделайте фиктивный коммит и напишите для него сообщение
# в соответствии с Conventional Commits (используя тип fix).
#
# git commit -m 'fix: correct rounding of numbers'
#
# 3) Добавление новой функциональности:
# Допустим, вы реализовали новую функцию generateReport в проекте.
# Сделайте фиктивный коммит с типом feat, отражающий добавление этой функциональности
#
# git commit -m 'feat: add new function generateReport in project'
#
# 4) Модификация формата кода или стилей:
# Представьте, что вы поправили отступы и форматирование во всём проекте, не меняя логики кода.
# Сделайте фиктивный коммит с типом style
#
# git commit -m 'style: delete indentation and formatting project'
#
# 5) Документация и тестирование:
# Сделайте фиктивный коммит с типом docs,
# добавляющий или улучшающий документацию для вашей новой функции.
# Сделайте фиктивный коммит с типом test,
# добавляющий тесты для этой же функции.
#
# git commit -m 'docs: add new documentation for new func'
# git commit -m 'test: add new test for new func'

#
