"""TASK Commits #5."""

# 1. Опишите своими словами назначение каждого из этих типов коммитов:
# feat, fix, docs, style, refactor, test, build, ci, perf, chore.
#
# feat -- добавление нового функционала
#
# fix -- исправление багов
#
# docs -- изменения в документации
#
# style -- форматирование кода
#
# refactor -- рефакторинг кода без изменения логики
#
# test -- добавление/удаление тестов
#
# build -- изменения в системе сборки или в зависимостях
#
# ci -- изменения в CI
#
# perf -- перформанс, улучшение производительности
#
# chore -- прочие изменения, которые не относятся к функциональности или исправлениям
#
# 2. Представьте, что вы исправили баг в функции, которая некорректно округляет числа. Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits (используя тип fix).
#
# git commit -m "fix: correct number rounding"
#
#
