"""2026-02-05 [TASK] Commits #5."""

#
# 1. Опишите своими словами назначение каждого из этих типов коммитов:
# feat, fix, docs, style, refactor, test, build, ci, perf, chore.
#
#     -feat: добавлена новая функция;
#     -fix: исправлен баг, ошибка;
#     -docs: изменение ТОЛЬКО в документации к проекту;
#     -style: изменения, которые не влияют на смысл кода (форматирование);
#     -refactor: изменения не влияющие на функциональность программы (не устраняют баг и не добавляют фичу);
#     -test: добавляет тесты для программы;
#     -build: изменение влияющие на систему сборки или на зависимости;
#     -ci: изменения связанные с автоматизацией и сборкой;
#     -perf:повышение производительности;
#     -chore: различные задачи не влияющие на код программы.
#
# 2. Представьте, что вы исправили баг в функции, которая некорректно округляет числа. Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits (используя тип fix).
#
#     fix: исправлена ошибка в функции округления числа.
#
# 3. Добавление новой функциональности:
# Допустим, вы реализовали новую функцию generateReport в проекте. Сделайте фиктивный коммит с типом feat, отражающий добавление этой функциональности
#
#     feat: в проект добавлена новая функция generateReport.
#
# 4. Модификация формата кода или стилей:
# Представьте, что вы поправили отступы и форматирование во всём проекте, не меняя логики кода. Сделайте фиктивный коммит с типом style
#
# style: исправлены форматирование и отступы в коде.
#
# 5. Документация и тестирование:
#
# Сделайте фиктивный коммит с типом docs, добавляющий или улучшающий документацию для вашей новой функции.
# Сделайте фиктивный коммит с типом test, добавляющий тесты для этой же функции.
#
#     docs: добавлено описание функции;
#     test: добавлено тестирование к функции.
#
# Отправьте сюда в комменты ссылку на ваши коммиты https://github.com/ВАШ-ЛОГИН/Data-Science-For-Beginners-from-scratch-SENATOROV/commits/main/
#
#     https://github.com/SERG-1613/Data-Science-For-Beginners-from-scratch-SENATOROV/commits/main/
