"""[TASK] Commits  #5."""

# 1. Опишите своими словами назначение каждого из этих типов коммитов:
#     - feat - добавление новой функциональности
#     - fix - исправление бага
#     - docs - изменения в документации
#     - style - исправления форматирования кода
#     - refactor - рефакторинг кода без изменения поведения
#     - test - изменения в тестах
#     - build - изменения сборки
#     - ci - настройки ci/cd
#     - perf - оптимизация/производительность
#     - chore - обновление зависимостей, настройка проекта
# 2. Представьте, что вы исправили баг в функции, которая некорректно округляет числа. Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits (используя тип fix).
#     - git commit -m "fix: correct rounding logic"
# 3. Добавление новой функциональности:
# Допустим, вы реализовали новую функцию generateReport в проекте. Сделайте фиктивный коммит с типом feat, отражающий добавление этой функциональности
#     - git commit -m "feat: generate report functionality"
