"""TASK Commits #5."""

# 1. Опишите своими словами назначение каждого из этих типов коммитов:
# feat, fix, docs, style, refactor, test, build, ci, perf, chore.
#
# feat -- добавление нового функционала
#
# fix -- исправление багов
#
# docs -- изменения в документации
#
# style -- форматирование кода
#
# refactor -- рефакторинг кода без изменения логики
#
# test -- добавление/удаление тестов
#
# build -- изменения в системе сборки или в зависимостях
#
# ci -- изменения в CI
#
# perf -- перформанс, улучшение производительности
#
# chore -- прочие изменения, которые не относятся к функциональности или исправлениям
#
# 2. Представьте, что вы исправили баг в функции, которая некорректно округляет числа. Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits (используя тип fix).
#
# git commit -m "fix: correct number rounding"
#
# 3. Добавление новой функциональности:
# Допустим, вы реализовали новую функцию generateReport в проекте. Сделайте фиктивный коммит с типом feat, отражающий добавление этой функциональности
#
# git commit -m "feat: add generateReport function"
#
# 4. Модификация формата кода или стилей:
# Представьте, что вы поправили отступы и форматирование во всём проекте, не меняя логики кода. Сделайте фиктивный коммит с типом style
#
# git commit -m "style: indents and code formatting"
#
# 5. Документация и тестирование:
#
# Сделайте фиктивный коммит с типом docs, добавляющий или улучшающий документацию для вашей новой функции.
#
# git commit -m "docs: add/edit func documentation"
#
