"""Ответы на вопросы по TASK 5."""

# **1. Опишите своими словами назначение каждого из этих типов коммитов:**
# - feat - добавление новой функциональности (feature)
# - fix - решение какой-либо неисправности (бага)
# - docs - оформление/изменение документации
# - style -  правки, которые не влияют на логику работы кода: исправление отступов, удаление лишних пробелов, приведение форматирования к единому стандарту и др.
# - refactor - рефакторинг кода - изменение структуры проекта, без изменения функционала
# - test - работа с тестами, при этом основной код не затрагивается
# - build - изменениям в системе сборки или внешних зависимостях (добавление/удаление пакетов)
# - ci - настройка непрерывной интеграции и доставки: изменения в конфигурации, сюда же — правки скриптов деплоя или проверок, которые запускаются автоматически
# - perf - изменения, которые улучшают производительность кода, скорость работы, потребление памяти, время загрузки
# - chore - коммит, который не устраняет баг и не вносит новый функционал, а модифицирует или обновляет зависимости
#

# **2. Представьте, что вы исправили баг в функции, которая некорректно округляет числа. Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits (используя тип fix).**
#
# Сообщение для коммита: fix: correct rounding function for numbers

# **3. Добавление новой функциональности:
# Допустим, вы реализовали новую функцию generateReport в проекте. Сделайте фиктивный коммит с типом feat, отражающий добавление этой функциональности**
#
# Сообщение для коммита: feat: added generateReport function for exporting data

# **4. Модификация формата кода или стилей:
# Представьте, что вы поправили отступы и форматирование во всём проекте, не меняя логики кода. Сделайте фиктивный коммит с типом style**

# **5. Сделайте фиктивный коммит с типом docs, добавляющий или улучшающий документацию для вашей новой функции.
# Сделайте фиктивный коммит с типом test, добавляющий тесты для этой же функции.**

# **6. Отправьте сюда в комменты ссылку на ваши коммиты https://github.com/ВАШ-ЛОГИН/Data-Science-For-Beginners-from-scratch-SENATOROV/commits/main/**
