# %% [markdown]
#
# # Ответы на вопросы по issues - commit
#  
# 1. feat - тип, которые используется при добавлении новой функциональности, то что вносит что-то новое, но  не влияет на совместимость, соответствует MINOR.  
# fix - также не влияет на совместимость, изменения которые фиксят баги, соответствует PATCH.  
# docs - изменения вносимые в документацию.  
# style - все изменения относящиеся к форматированию и стилю кода, оформление (пробелы, табы и т.д.).  
# refactor - переписывание или улучшения структуры кода, но не меняющая функциональность.  
# test - добавление или изменения тестов, не меняя кода.  
# build - изменения чего-то в конфигурации сборки или зависимостях проекта, в технической части, отвечающей  за запуск и упаковку проекта, но не в самом коде приложения.  
# ci - изменения, связанные с автоматической сборкой и тестированием.  
# perf - изменения относящиеся к ускорения или снижения потребления ресурсов, например убрать лишнюю 
# обработку данных.  
# chore - разные рутинные задачи, все что не влияет на код программы.  
#
# 2. fix: исправлена ошибка функции - округления чисел
#
# 3. feat: добавлена функция generateReport для формирования отчётов
#
# 4. style: исправлено форматирование и отступы во всём проекте
#
# 5. docs(report): добавлено описание функции generateReport в README
#
# 6. test(report): добавлены тесты для функции generateReport
#
