"""Commits."""

# 1. Опишите своими словами назначение каждого из этих типов коммитов:
# `feat` - коммит добавляет новый функционал в код;
# `fix` - коммит исправляет баг в коде;
# `docs` - коммит связан с обновлением или исправлением документации;
# `style` - коммит для изменения стиля кода;
# `refactor` - коммит для изменения структуры кода без добавления новых \функций или исправления багов;
# `test` - коммит для добавления или изменения тестового кода;
# `build` - коммит влияющий на процесс сборки проекта;
# `ci` - коммит для изменений, связанных с непрерывной интеграцией;
# `perf` - коммит для улучшения производительности кода;
# `chore` - коммит для вспомогательных или рутинных задач, не связанных \напрямую с функциональностью или исправлением ошибок.
#
# 2. Представьте, что вы исправили баг в функции, которая некорректно округляет числа. Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits (используя тип fix).
# `git commit -m 'fix: added correct number rounding'`
#
# 3. Добавление новой функциональности:
# Допустим, вы реализовали новую функцию generateReport в проекте. Сделайте \фиктивный коммит с типом feat, отражающий добавление этой функциональности
# `git commit -m 'feat: add generatereport function'`
#
# 4. Модификация формата кода или стилей:
# Представьте, что вы поправили отступы и форматирование во всём проекте, не \меняя логики кода. Сделайте фиктивный коммит с типом style
# `git commit -m 'style: fixed indentation and formatting'`
#
# 5. Документация и тестирование:
# Сделайте фиктивный коммит с типом docs, добавляющий или улучшающий \документацию для вашей новой функции.
# `git commit -m 'docs: add documentation for generatereport function'`
# Сделайте фиктивный коммит с типом test, добавляющий тесты для этой же \функции.
# `git commit -m 'test: add tests for generatereport function'`
