{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ab7eaf67",
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"[TASK] Cpython  #4.\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3d600052",
   "metadata": {},
   "source": [
    "Введение в Python и CPython\n",
    "\n",
    "1. Что такое CPython и чем он отличается от Python?\n",
    "3. Сколько существует реализаций Python, и какая из них самая популярная?\n",
    "6 реализаций, самая популярная - CPython\n",
    "4. На каком языке написан CPython?\n",
    "На языке \"C\"\n",
    "\n",
    "Поиск и установка CPython\n",
    "\n",
    "5. (опционально) Кто создал CPython?\n",
    "Guido van Rossum\n",
    "6. Почему Python считается быстрым, несмотря на то, что это интерпретируемый язык?\n",
    "Ядро написано на языке \"C\"\n",
    "7. Напишите путь к Интерпретатору CPython на вашем компьютере\n",
    "C:\\Users\\Yeaaah\\AppData\\Local\\Programs\\Python\\Python314\\python.exe\n",
    "\n",
    "Структура CPython\n",
    "\n",
    "8. Что содержится в папке include в CPython?\n",
    "Файлы заголовков на языке \"C\" с расширением .h\n",
    "9. Где можно найти исходный код CPython дайте ссылку на репозиторий гитхаб\n",
    "https://github.com/python/cpython.\n",
    "10. (опционально) Как работает интерпретатор CPython при выполнении кода?\n",
    "Выполняет код построчно\n",
    "\n",
    "Запуск файла с помощью CPython\n",
    "\n",
    "11. Какая команда используется для запуска файла с помощью CPython?\n",
    "python filename\n",
    "12. Можно ли запускать текстовые файлы через интерпретатор Python? Почему?\n",
    "Можно, интерпретатору не важно расширение файла\n",
    "13. Как указать путь к интерпретатору и файлу для выполнения кода?\n",
    "Скопировать пути к интерпретатору и файлу, вставить в консоль через пробел\n",
    "\n",
    "Введение в PyPy\n",
    "\n",
    "14. Чем PyPy отличается от CPython?\n",
    "CPython — это реализация Python, написанная на языке C.\n",
    "PyPy — это альтернативная реализация, написанная на RPython.\n",
    "15. Почему PyPy не может использоваться для всех проектов на Python?\n",
    "PyPy достаточно новый и еще не совместим со всеми проектами на питоне\n",
    "16. Где можно скачать PyPy?\n",
    "https://pypy.org/download.html\n",
    "\n",
    "Установка и запуск PyPy\n",
    "\n",
    "17. Как установить PyPy после скачивания?\n",
    "Распаковать архив в нужную директорию\n",
    "18. Как запустить файл с помощью PyPy?\n",
    "pypy filename\n",
    "19. Почему PyPy выполняет код быстрее, чем CPython?\n",
    "В PyPy JIT-компилятор (just-in-time compiler) для Python,\n",
    "компилирующий программы непосредственно в процессе их выполнения\n",
    "\n",
    "Практические задания\n",
    "\n",
    "Задание 1: Поиск и установка CPython\n",
    "\n",
    "Проверьте, установлен ли CPython на вашем компьютере:\n",
    "    Используйте поиск в меню \"Пуск\" (Windows) или терминале (Linux/Mac).\n",
    "    Введите команду python --version или python3 --version в терминале.\n",
    "Если CPython не установлен, скачайте его с официального сайта \n",
    "Python https://www.python.org/downloads/ и установите.\n",
    "\n",
    "Python 3.14.2\n",
    "\n",
    "Задание 2: Исследование структуры CPython\n",
    "\n",
    "Найдите папку, где установлен Python (например, через команду where python в терминале или свойства ярлыка).\n",
    "\n",
    "C:\\Users\\Yeaaah\\AppData\\Local\\Programs\\Python\\Python314\\\n",
    "\n",
    "Откройте папку include и изучите её содержимое. Какое количество файлов на C там есть?\n",
    "\n",
    "79 файлов\n",
    "\n",
    "Перейдите на [GitHub-репозиторий CPython](https://github.com/python/cpython) и найдите файл README. Прочитайте информацию о проекте.\n",
    "\n",
    "Задание 3: Запуск файла с помощью CPython\n",
    "\n",
    "Создайте текстовый файл example.txt с содержимым:\n",
    "\n",
    "print(\"Hello from CPython!\")\n",
    "\n",
    "Запустите файл через команду python <путь_до_файла> (замените <путь_до_файла> на фактический путь к вашему файлу).\n",
    "Проверьте, что выводится на экран.\n",
    "\n",
    "python B:\\Projects\\example.txt\n",
    "Hello from CPython!\n",
    "\n",
    "Попробуйте изменить расширение файла на .py и повторите запуск.\n",
    "\n",
    "B:\\Projects\\example.py \n",
    "Hello from CPython!\n",
    "\n",
    "Задание 4: Установка и использование PyPy\n",
    "\n",
    "Перейдите на [официальный сайт PyPy](https://www.pypy.org/) и скачайте подходящую версию для вашей операционной системы.\n",
    "Распакуйте скачанный архив в удобное место.\n",
    "Создайте файл example_pypy.py с кодом:\n",
    "\n",
    "print(\"Hello from pypy!\")\n",
    "\n",
    "Запустите файл через PyPy\n",
    "pypy <путь_до_файла> (замените <путь_до_файла> на фактический путь к вашему файлу).\n",
    "\n",
    "pypy B:\\Projects\\example_pypy.py\n",
    "Hello from pypy!\n",
    "\n",
    "Проверьте, что выводится на экран. Попробуйте изменить расширение файла на .py и повторите запуск.\n",
    "\n",
    "Задание 5: Сравнение производительности CPython и PyPy\n",
    "\n",
    "Создайте файл performance_test.py с кодом:\n",
    "\n",
    "    import time\n",
    "    start_time = time.time()\n",
    "    total = 0\n",
    "    for i in range(1, 10000000):\n",
    "        total += i\n",
    "    end_time = time.time()\n",
    "    \n",
    "    print(\"Result:\", total)\n",
    "    print(\"Execution time:\", end_time - start_time, \"seconds\")\n",
    "\n",
    "Запустите этот файл сначала через CPython, а затем через PyPy. Запишите результаты времени выполнения для обоих интерпретаторов.\n",
    "\n",
    "py B:\\Projects\\performance_test.py\n",
    "Result: 49999995000000\n",
    "Execution time: 1.3850445747375488 seconds\n",
    "pypy B:\\Projects\\performance_test.py\n",
    "Result: 49999995000000\n",
    "Execution time: 0.015033960342407227 seconds\n",
    "\n",
    "Сделайте вывод о разнице в производительности.\n",
    "\n",
    "pypy отработал быстрее практически в 100 раз\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
