{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9fd89528",
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Quiz Cpython.\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c38ceb13",
   "metadata": {},
   "source": [
    "### 1. Что такое CPython и чем он отличается от Python?\n",
    "#Python — это язык, а CPython — это интерпретатор"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f004ff7b",
   "metadata": {},
   "source": [
    "3. Сколько существует реализаций Python, и какая из них самая популярная?\n",
    "#самые популярные CPython, которая является стандартной реализацией. Другие заметные реализации включают Jython (написан на Java), IronPython (для .NET) и PyPy (быстрая реализация с JIT-компиляцией)\n",
    "4. На каком языке написан CPython?\n",
    "#на яп С\n",
    "Поиск и установка CPython\n",
    "5. (опционально) Кто создал CPython?\n",
    "#Гвидо ван Россум\n",
    "6. Почему Python считается быстрым, несмотря на то, что это интерпретируемый язык?\n",
    "#он считается \"быстрым\" с точки зрения скорости разработки — написание кода на Python занимает меньше времени, чем на других языках\n",
    "7. Напишите путь к Интерпретатору CPython на вашем компьютере\n",
    "Структура CPython\n",
    "#C:\\Users\\Maksat\\AppData\\Local\\Programs\\Python\\Python39\\python.exe\n",
    "\n",
    "Что содержится в папке include в CPython?\n",
    "#содержит файл необходимые для создания расширений на яп С\n",
    "Где можно найти исходный код CPython дайте ссылку на репозиторий гитхаб\n",
    "#https://github.com/python/cpython\n",
    "Запуск файла с помощью CPython\n",
    "11. Какая команда используется для запуска файла с помощью CPython?\n",
    "#если он установлен правильно(добавлен в переменные среды то ) python <file_name.py>\n",
    "12. Можно ли запускать текстовые файлы через интерпретатор Python? Почему?\n",
    "#да если этот текстовый файл содержит валидный синтаксис Python\n",
    "13. Как указать путь к интерпретатору и файлу для выполнения кода? Сначала путь к интерпретатору а потом к файлу\n",
    "Введение в PyPy\n",
    "#\n",
    "\n",
    "14. Чем PyPy отличается от CPython?\n",
    "#PyPy компилирует часть кода \"на лету\" в машинный код главное отличие — наличие JIT-компилятора (Just-In-Time)\n",
    "Почему PyPy не может использоваться для всех проектов на Python?\n",
    "из-за проблем совместимости\n",
    "Где можно скачать PyPy?\n",
    "#https://www.pypy.org/download.html\n",
    "Установка и запуск PyPy\n",
    "\n",
    "17. Как установить PyPy после скачивания?\n",
    "##его достаточно распаковать в удобную папку затем можно добавить путь к исполняемому файлу PyPy в системную переменную PATH\n",
    "18. Как запустить файл с помощью PyPy?\n",
    "#pypy <file_name.py>\n",
    "19. Почему PyPy выполняет код быстрее, чем CPython?\n",
    "#Он анализирует часто используемые участки кода и компилирует их в машинный код во время выполнения это позволяет избежать накладных расходов на интерпретацию байт-кода\n",
    "Задание 5: Сравнение производительности CPython и PyPy\n",
    "\n",
    "Создайте файл performance_test.py с кодом:\n",
    "    import time\n",
    "    start_time = time.time()\n",
    "    total = 0\n",
    "    for i in range(1, 10000000):\n",
    "        total += i\n",
    "    end_time = time.time()\n",
    "    \n",
    "    print(\"Result:\", total)\n",
    "    print(\"Execution time:\", end_time - start_time, \"seconds\")\n",
    "Запустите этот файл сначала через CPython, а затем через PyPy. Запишите результаты времени выполнения для обоих интерпретаторов.\n",
    "Сделайте вывод о разнице в производительности.\n",
    "\n",
    "Result: 49999995000000\n",
    "Execution time: 0.008118867874145508 seconds\n",
    "Result: 49999995000000\n",
    "Execution time: 0.5473790168762207 seconds\n",
    "0.5473790168762207/0.008118867874145508 = 67.42"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
