# CPython

# 1. Что такое CPython и чем он отличается от Python?
#
# CPython - реализация Python, написанная на языке C
#
# CPythoon интерпретирует и исполняет python код. Он его запускает.
# Python - язык программирования. На нём пишутся программы.

# 3. Сколько существует реализаций Python, и какая из них самая популярная?
#
# Существует 6 реализаций Python, самая популярная из которых - CPython.

# 4. На каком языке написан CPython?
#
# На C

# 5. (опционально) Кто создал CPython?
#
# Гвидо ван Россум

# 6. Почему Python считается быстрым, несмотря на то, что это интерпретируемый язык?
#
# Работает на C

# 7. Напишите путь к Интерпретатору CPython на вашем компьютере
#
# c:\Python312\python.exe

# 8. Что содержится в папке include в CPython?
#
# Исходные файлы, написанные на C

# 9. Где можно найти исходный код CPython дайте ссылку на репозиторий гитхаб
#
# https://github.com/python/cpython

# 10. (опционально) Как работает интерпретатор CPython при выполнении кода?
#
# Python код переводится в байт-код через инструкции на С, после чего сохраняется в .pyc файл.

# 11. Какая команда используется для запуска файла с помощью CPython?
#
# Путь\До\Интерпретатора Путь\к\файлу\с\кодом
#
# либо
#
# python Путь\к\файлу\с\кодом

# 12. Можно ли запускать текстовые файлы через интерпретатор Python? Почему?
#
# Можно, т.к. интерпретатор сканирует содержимое файла, не обращая внимания на его расширение

# 13. Как указать путь к интерпретатору и файлу для выполнения кода?
#
# Путь\До\Интерпретатора Путь\к\файлу\с\кодом

# 14. Чем PyPy отличается от CPython?
#
# PyPy более быстрый, чем CPython

# 15. Почему PyPy не может использоваться для всех проектов на Python?
#
# Есть проблемы с совместимосью CPython и PyPy

# 16. Где можно скачать PyPy?
#
# https://pypy.org

# 17. Как установить PyPy после скачивания?
#
# - Распаковать архив
# - Запустить exe файл, на маке в папке bin

# 18. Как запустить файл с помощью PyPy?
#
# Путь\До\PyPy Путь\До\Файла

# 19. Почему PyPy выполняет код быстрее, чем CPython?
#
# В PyPy используется JIT-компиляция

# # Практические задания
#
# Задание 1: Поиск и установка CPython
#
# установлен

# Задание 2: Исследование структуры
#
# 74 файла на С

# Задание 3: Запуск файла с помощью CPython
#
# Выполнено

# Задание 4: Установка и использование PyPy
#
# Выполнено

# Задание 5: Сравнение производительности CPython и PyPy
#
# CPython
#
# Result: 49999995000000
#
# Execution time: 0.7920436859130859 seconds
#
# PyPy
#
# Result: 49999995000000
#
# Execution time: 0.02134394645690918 seconds
#
# PyPy работает гораздо быстрее

#
