"""Issue #4, made by Gosha Gosha (tg.:@dddos_1107)."""

# # Домашнее задание
#
# ## Реализации Python
#
# ### 3. Сколько существует реализаций Python, и какая из них самая популярная?
#
# **Ответ:**
#
# - 6+
# Самая популярная - CPython
#
# ---
#
# ### 4. На каком языке написан CPython?
#
# **Ответ:**
#
# - C
#
# ---
#
# ### 5. Кто создал CPython? *(опционально)*
#
# **Ответ:**
#
# - Guido von Rossum
#
# ---
#
# ### 6. Почему Python считается быстрым, несмотря на то, что это интерпретируемый язык?
#
# **Ответ:**
#
# - Много динамических бибилотек под капотом
#
# ---
#
# ### 7. Напишите путь к Интерпретатору CPython на вашем компьютере.
#
# **Ответ:**
#
# ```~AppData/Local/Programs/Python/Python313/python.exe
#
# ```
#
# ---
#
# # Структура CPython
#
# ### 8. Что содержится в папке `include` в CPython?
#
# **Ответ:**
#
# - Заголовки С
#
#
# ---
#
# ### 9. Где можно найти исходный код CPython? Дайте ссылку на репозиторий GitHub.
#
# **Ответ:**
#
# ```https://github.com/python/cpython
#
# ```
#
# ---
#
# ### 10. Как работает интерпретатор CPython при выполнении кода? *(опционально)*
#
# **Ответ:**
#
# 1. Парсинг в AST
# 2. компиляция в байт-код
# 3. интепретация байт-кода
#
#
# ---
#
# # Запуск файла с помощью CPython
#
# ### 11. Какая команда используется для запуска файла с помощью CPython?
#
# **Ответ:**
#
# ```python file.py
#
# ```
#
# ---
#
# ### 12. Можно ли запускать текстовые файлы через интерпретатор Python? Почему?
#
# **Ответ:**
#
# - Да
# ---
#
# ### 13. Как указать путь к интерпретатору и файлу для выполнения кода?
#
# **Ответ:**
#
# ```
# Просто скопировать их пути и указать
# ```
#
# ---
#
# # Введение в PyPy
#
# ### 14. Чем PyPy отличается от CPython?
#
# **Ответ:**
#
# - PyPy реализован на RPуthon и работает в стиле tracing JIT
#
# ---
#
# ### 15. Почему PyPy не может использоваться для всех проектов на Python?
#
# **Ответ:**
#
# - warm-up стиль JIT подходит не каждому коду и может только замедлять его, а не ускорять ( в худшем сценарии)
#
# ---
#
# ### 16. Где можно скачать PyPy?
#
# **Ответ:**
#
# ```https://pypy.org/
#
# ```
#
# ---
#
# # Установка и запуск PyPy
#
# ### 17. Как установить PyPy после скачивания?
#
# **Ответ:**
#
# Никак. Просто распаковать архив с готовым интепретатором. Ну и можно конечно в PATH добавить.
#
#
# ---
#
# ### 18. Как запустить файл с помощью PyPy?
#
# **Ответ:**
#
# ```так же как и с CPython
#
# ```
#
# ---
#
# ### 19. Почему PyPy выполняет код быстрее, чем CPython?
#
# **Ответ:**
#
# См. пункт 14
#
# ---
#
# > **Примечание:** Все пустые места после **«Ответ:»**, пустые элементы списков, нумерованных списков и пустые блоки кода предназначены для вписывания ответов.
