{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e02506d0",
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Ответы на вопросы по CPython.\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "df66c38c",
   "metadata": {},
   "source": [
    "**Теория**\n",
    "\n",
    "1. Что такое CPython и чем он отличается от Python?\n",
    "\n",
    "python это язык, cpython это язык и одна из реализаций интерпретатора на языке С\n",
    "\n",
    "3. Сколько существует реализаций Python, и какая из них самая популярная?\n",
    "\n",
    "6 реализаций на С самая популярная\n",
    "\n",
    "4. На каком языке написан CPython?\n",
    "\n",
    "С\n",
    "\n",
    "5. (опционально) Кто создал CPython?\n",
    "\n",
    "Гвидо ван Россум\n",
    "\n",
    "6. Почему Python считается быстрым, несмотря на то, что это интерпретируемый язык?\n",
    "\n",
    "потому что написан на компилируемом С\n",
    "\n",
    "7. Напишите путь к Интерпретатору CPython на вашем компьютере\n",
    "\n",
    "~/.venv/bin/python\n",
    "\n",
    "8. Что содержится в папке include в CPython?\n",
    "\n",
    "заголовочные файлы на языке С\n",
    "\n",
    "9. Где можно найти исходный код CPython дайте ссылку на репозиторий гитхаб\n",
    "\n",
    "https://github.com/python/cpython\n",
    "\n",
    "10. (опционально) Как работает интерпретатор CPython при выполнении кода?\n",
    "\n",
    "последовательно читает и исполняет каждую строчку написанную в файле\n",
    "\n",
    "11. Какая команда используется для запуска файла с помощью CPython?\n",
    "\n",
    "python filename\n",
    "\n",
    "12. Можно ли запускать текстовые файлы через интерпретатор Python? Почему?\n",
    "\n",
    " да. не важно расширение файла важно его содержание\n",
    "\n",
    "13. Как указать путь к интерпретатору и файлу для выполнения кода?\n",
    "\n",
    "указав путь относительный или абсолютный\n",
    "\n",
    "14. Чем PyPy отличается от CPython?\n",
    "\n",
    "занчительно быстрее, в десятки раз\n",
    "\n",
    "15. Почему PyPy не может использоваться для всех проектов на Python?\n",
    "\n",
    "слишком молодой и нет совместимостимости со всеми реализациями\n",
    "\n",
    "16. Где можно скачать PyPy?\n",
    "\n",
    "https://pypy.org/download.html\n",
    "\n",
    "17. Как установить PyPy после скачивания?\n",
    "\n",
    "распаковать и прописать пути в переменных средах\n",
    "\n",
    "18. Как запустить файл с помощью PyPy?\n",
    "\n",
    "так же как и обычный python см. п. 13\n",
    "\n",
    "19. Почему PyPy выполняет код быстрее, чем CPython?\n",
    "\n",
    "PyPy использует Just-In-Time компилятор для компиляции Python в машинный код во время выполнения\n",
    "\n",
    "**Практические задания**\n",
    "\n",
    "Задание 1: Поиск и установка CPython\n",
    "\n",
    "Python 3.13.9\n",
    "\n",
    "Задание 2: Исследование структуры CPython\n",
    "\n",
    "Прочитал README проекта\n",
    "\n",
    "Задание 3: Запуск файла с помощью CPython"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "04f095a8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Hello python\n"
     ]
    }
   ],
   "source": [
    "import time\n",
    "\n",
    "print(\"Hello python\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "47043632",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: 49999995000000\n",
      "Execution time: 4.574161052703857 seconds\n"
     ]
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "total = 0\n",
    "for i in range(1, 10000000):\n",
    "    total += i\n",
    "end_time = time.time()\n",
    "\n",
    "print(\"Result:\", total)\n",
    "print(\"Execution time:\", end_time - start_time, \"seconds\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "107fdd20",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
