{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "52665960",
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"SENATOROVAI/intro-cs/issues/4.\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "18a7a641",
   "metadata": {},
   "source": [
    "1. Что такое CPython и чем он отличается от Python?\n",
    "    - CPython — это реализация языка Python, написанная на C\n",
    "3. Сколько существует реализаций Python, и какая из них самая популярная?\n",
    "    - Существует как минимум 6 реализаций языка Python\n",
    "    - CPython самая популярная\n",
    "4. На каком языке написан CPython?\n",
    "    - CPython написан на си\n",
    "5. (опционально) Кто создал CPython?\n",
    "    - CPython создал Гвидо ван Россум\n",
    "6. Почему Python считается быстрым, несмотря на то, что это интерпретируемый язык?\n",
    "    - CPython позволяет запускать быстрый код написанный на си\n",
    "7. Напишите путь к Интерпретатору CPython на вашем компьютере\n",
    "```\n",
    "% which python\n",
    "/opt/anaconda3/bin/python\n",
    "```\n",
    "8. Что содержится в папке include в CPython?\n",
    "    - заголовочные файлы C (C header files)\n",
    "9. Где можно найти исходный код CPython дайте ссылку на репозиторий гитхаб\n",
    "    - https://github.com/python/cpython\n",
    "10. (опционально) Как работает интерпретатор CPython при выполнении кода?\n",
    "    - Лексический анализ (токенизация)\n",
    "    - Синтаксический анализ (построение AST)\n",
    "    - Генерация байт-кода\n",
    "    - Байт-кода выполняется построчно на си\n",
    "11. Какая команда используется для запуска файла с помощью CPython?\n",
    "    - python file.py\n",
    "12. Можно ли запускать текстовые файлы через интерпретатор Python? Почему?\n",
    "    - Да, можно, потому что интерпретатор анализирует содержимое файла, а не его расширение\n",
    "13. Как указать путь к интерпретатору и файлу для выполнения кода?\n",
    "```\n",
    "% echo \"print(1)\" > 1\n",
    "% /opt/anaconda3/bin/python 1\n",
    "1\n",
    "```\n",
    "14. Чем PyPy отличается от CPython?\n",
    "    - PyPy использует JIT-компиляцию для оптимизации производительности, в отличие от интерпретатора CPython\n",
    "15. Почему PyPy не может использоваться для всех проектов на Python?\n",
    "    - PyPy несовместим со многими C-расширениями и библиотеками, разработанными specifically для CPython\n",
    "16. Где можно скачать PyPy?\n",
    "    - https://pypy.org/download.html\n",
    "17. Как установить PyPy после скачивания?\n",
    "    - Распаковать архив\n",
    "18. Как запустить файл с помощью PyPy?\n",
    "```\n",
    "% /Users/aleksey/Downloads/pypy3.11-v7.3.20-macos_arm64/bin/python 1\n",
    "1\n",
    "```\n",
    "19. Почему PyPy выполняет код быстрее, чем CPython?\n",
    "    - PyPy использует JIT-компиляцию, которая оптимизирует часто выполняемый код в машинные инструкции во время работы программы.\n",
    "\n",
    "\n",
    "### Практические задания\n",
    "\n",
    "##### Задание 1: Поиск и установка CPython\n",
    "Проверьте, установлен ли CPython на вашем компьютере:\n",
    "    Используйте поиск в меню \"Пуск\" (Windows) или терминале (Linux/Mac).\n",
    "    Введите команду python --version или python3 --version в терминале.\n",
    "Если CPython не установлен, скачайте его с официального сайта Python https://www.python.org/downloads/ и установите.\n",
    "\n",
    "ответ: Python 3.13.5\n",
    "\n",
    "##### Задание 2: Исследование структуры CPython\n",
    "Найдите папку, где установлен Python (например, через команду which python в терминале или свойства ярлыка).\n",
    "Откройте папку include и изучите её содержимое. Какое количество файлов на C там есть?\n",
    "Перейдите на [GitHub-репозиторий CPython](https://github.com/python/cpython) и найдите файл README. Прочитайте информацию о проекте.\n",
    "\n",
    "ответ: 76\n",
    "\n",
    "##### Задание 3: Запуск файла с помощью CPython\n",
    "Создайте текстовый файл example.txt с содержимым:\n",
    "print(\"Hello from CPython!\")\n",
    "\n",
    "Запустите файл через команду python <путь_до_файла> (замените <путь_до_файла> на фактический путь к вашему файлу).\n",
    "Проверьте, что выводится на экран. Попробуйте изменить расширение файла на .py и повторите запуск.\n",
    "\n",
    "ответ: \n",
    "```\n",
    "% echo \"print(\\\"Hello from CPython\\\")\" > example.txt\n",
    "% python example.txt                                \n",
    "Hello from CPython\n",
    "% echo \"print(\\\"Hello from CPython\\\")\" > example.py \n",
    "% python example.txt                               \n",
    "Hello from CPython\n",
    "```\n",
    "##### Задание 4: Установка и использование PyPy\n",
    "Перейдите на [официальный сайт PyPy](https://www.pypy.org/) и скачайте подходящую версию для вашей операционной системы.\n",
    "Распакуйте скачанный архив в удобное место.\n",
    "Создайте файл example_pypy.py с кодом:\n",
    "\n",
    "ответ: \n",
    "```\n",
    "% echo \"print(\\\"Hello from pypy\\\")\" > example_pypy.py\n",
    "% /Users/aleksey/Downloads/pypy3.11-v7.3.20-macos_arm64/bin/python example_pypy.py\n",
    "Hello from pypy\n",
    "```\n",
    "\n",
    "##### Задание 5: Сравнение производительности CPython и PyPy.\n",
    "Создайте файл performance_test.py с кодом:\n",
    "```\n",
    "    import time\n",
    "    start_time = time.time()\n",
    "    total = 0\n",
    "    for i in range(1, 10000000):\n",
    "        total += i\n",
    "    end_time = time.time()\n",
    "    \n",
    "    print(\"Result:\", total)\n",
    "    print(\"Execution time:\", end_time - start_time, \"seconds\")\n",
    "```\n",
    "Запустите этот файл сначала через CPython, а затем через PyPy. Запишите результаты времени выполнения для обоих интерпретаторов.\n",
    "Сделайте вывод о разнице в производительности.\n",
    "\n",
    "ответ:\n",
    "```\n",
    "% /Users/aleksey/Downloads/pypy3.11-v7.3.20-macos_arm64/bin/python performance_test.py\n",
    "Result: 49999995000000\n",
    "Execution time: 0.0232999324798584 seconds\n",
    "% python performance_test.py                       \n",
    "Result: 49999995000000\n",
    "Execution time: 0.5019669532775879 seconds\n",
    "```\n",
    "PyPy - быстрее примерно в 20 раз"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4204fa74",
   "metadata": {},
   "source": []
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
