"""Ответы на вопросы по виртуальному окружению."""

# 1. Что делает команда python -m venv venv?
#
#     Команда python -m venv venv создаёт в текущем каталоге папку venv, содержащую отдельную копию интерпретатора Python. Это позволяет изолировать зависимости проекта, предотвращая конфликты с глобально установленными библиотеками. После активации этого окружения все устанавливаемые пакеты будут добавляться только в него, не затрагивая основную систему.

# 1.1. Что делает каждая команда в списке ниже?
#
#     *   pip list – отображает список всех установленных в текущем окружении Python библиотек с их версиями;
#
#     *   pip freeze > requirements.txt – сохраняет список установленных библиотек и их версии в файл requirements.txt, что удобно для воспроизведения окружения;
#
#     *   pip install -r requirements.txt – устанавливает все зависимости, указанные в requirements.txt, в текущее окружение.

# 2. Что делает каждая команда в списке ниже?
#
# *   conda env list – выводит список всех сред (environments), созданных через Conda;
#
# *   conda create -n env_name python=3.5 – создаёт новое окружение с именем env_name, устанавливая в него Python версии 3.5;
#
# *   conda env update -n env_name -f file.yml – обновляет окружение env_name в соответствии с зависимостями, указанными в файле file.yml;
#
# *   source activate env_name – активирует окружение env_name, переключая среду на его использование;
#
# *   source deactivate – отключает текущее активное окружение, возвращая систему к стандартной (базовой) среде;
#
# *   conda clean -a – удаляет временные файлы, кешированные пакеты и неиспользуемые данные, освобождая место.

# 3. Вставьте скрин вашего терминала, где вы активировали сначала venv, потом conda, назовите окружение "SENATOROV"
#
# ![screen_sen_1.png](attachment:screen_sen_1.png)
#
# ![screen_sen_2_1.png](attachment:screen_sen_2_1.png)

# 4. Как установить необходимые пакеты внутрь виртуального окружения для conda/venv?
#
#     После активации виртуального окружения venv для установки пакетов необходимо использовать команду pip, например: pip install Pygments.
#
#     Если Вы работаете в окружении conda, для установки пакетов следует использовать команду conda, например: conda install libffi.

# 5. Что делают эти команды?
#     ```bash
#     pip freeze > requirements.txt
#     conda env export > environment.yml
#     ```
#
#     Команда pip freeze > requirements.txt сохраняет список всех пакетов, установленных в текущем виртуальном окружении Python, в файл requirements.txt.
#
#     Команда conda env export > environment.yml экспортирует все пакеты, установленные в активированном окружении conda, и сохраняет эту информацию в файл environment.yml.
#

# 5.1 Вставьте скрин, где будет видна папка VENV в вашем репозитории а также файлы зависимостей requirements.txt и environment.yml, файлы должны содержать зависимости
#
# ![screen_3_1.png](attachment:screen_3_1.png)
#
# ![screen_4.png](attachment:screen_4.png)
#
# ![screen_5_1.png](attachment:screen_5_1.png)

# 6. Что делают эти команды?
#
#     ```bash
#     pip install -r requirements.txt
#     conda env create -f environment.yml
#     ```
#
#     Данные команды служат для установки зависимостей, указанных в соответствующих файлах, созданных с помощью команд "pip freeze > requirements.txt", "conda env export > environment.yml".

# 7. Что делают эти команды?
#
#     ```bash
#     pip list
#     pip show,
#     conda list
#     ```
#
#     Команды pip list, pip show и conda list предназначены для отображения информации о установленных пакетах:
#
#     *   pip list — выводит список всех установленных пакетов Python в текущем виртуальном окружении, а также их версии;
#     *   pip show — выводит подробную информацию о конкретном пакете, включая его версию, местоположение, зависимости и другие метаданные;
#     *   conda list — отображает список всех установленных пакетов в текущем окружении conda, включая их версии и дополнительные данные.

# 8. Где по умолчанию больше пакетов venv/pip или conda? и почему дата сайнинисты используют conda?
#
#     По умолчанию в pip/venv больше пакетов, чем в conda.
#
#     Дата-сайентисты часто выбирают conda из-за её удобства, производительности и богатого набора пакетов, специально подобранных для работы с большими данными. Эти пакеты часто скомпилированы для различных операционных системах, что делает работу с ними более эффективной и стабильной.

# 9. Вставьте скрин где будет видно, Выбор интерпретатора Python (conda) в VS Code/cursor
#
# ![screen_6_1.png](attachment:screen_6_1.png)

# 10. Добавьте в .gitignore папку SENATOROV
#
#     Сделано.

# 11. Зачем нужно виртуальное окружение?
#
#     Виртуальное окружение является средством управления зависимостями. Оно обеспеичвает изоляцию проектов друг от друга, чтобы избежать конфликтов при использовании разных пакетов для разных проектов, а также позволяет использовать разные версии одного и того же пакета для работы с несколькими проектами.

# 12. С этого момента надо работать в виртуальном окружении conda, ты научился(-ась) выгружать зависимости и работать с окружением?
#
#     Да.

# 13. Удалите папку VENV, она больше не нужна, мы же не разрабы, нам нужна только conda
#
#     Сделано.
