"""Вторая часть задание по контрибьютингу."""

# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE -
# Да, есть MIT License
# 2. Напишите название понравившейся компании и ссылку на репозиторий -
# first-contributions, ссылка на репозиторий: https://github.com/firstcontributions/first-contributions
# 3. Проект активно принимает стороннюю помощь? -
# Да, у проекта 29 открытых и 830 закрытых issue, 93 565 закрытых pull request
# 4. Напишите второе улучшение которое вы сделали -
# Добавил файл с русским переводом в документацию
# 5. Посмотрите на коммиты в основной ветке, напишите общее количество -
# 2029 коммитов
# 6. Когда был последний коммит? -
# 27.02.2025
# 7. Сколько контрибьюторов у проекта? -
# Больше 5000
# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.) -
# Каждый день по 15+ коммитов
# 9. Сколько сейчас открытых ишью? -
# 29 открытых issue
# 10. Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются? -
# Достаточно быстро, в течение нескольких дней
# 11. Ведётся ли активное обсуждение ишью? -
# Да, почти все закрытые issue активно обсуждаются
# 12. Есть ли недавно созданные ишью? -
# Последний issue был создан 27.02.2025
# 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.) -
# Да, 830 закрытых issue
# 14. Сколько сейчас открытых пул-реквестов? -
# 58 открытых pull request
# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия? -
# Очень быстро, в течение нескольких часов после открытия
# 16. Ведётся ли активное обсуждение пул-реквестов? -
# Да, pull request активно обсуждаются
# 17. Есть ли недавно отправленные пул-реквесты? -
# 27.02.2025 было открыто 7 новых pull request
# 18. Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.) -
# 18 пул реквестов были объединены 27.02.2025
