# 1) Как понять, что домашка пришла?
#   1. 0:15-0:40. Нужно зайти в Telegram-группу, просмотреть чат с домашними заданиями.
# 2) Как принять домашку?
#   1. Принять pull-request
# 3) Зачем нужна кнопка history и какие функции появляются при нажатии правой кнопки мыши на коммит?
# 3.1) Где брать ссылку на коммит? куда её отправлять?
# 4) Что такое файл лога?
# 4.1) Когда нужно его пушить?
# 5) Что такое интерпритатор?
# 6) Где можно выбрать интерпритатор?
# 7) Что такое модуль?
# 8) Как создать и отправить коммит?
# 9) Как посмотреть что коммит точно отправлен и находится в github?
# 10) Какая команда показывает что код не прошёл проверки на ошибки?
# 10.1) Напишите список линтеров которые используются для проверки кода и дайте их краткую характеристику.
# 11) Как узнать какой именно линтер не прошёл проверку?
# 12) Линтер Pylint видит markdown?
# 13) Номер ячейки в терминале и номер ячейки в vs code может отличаться? в каком случае?
# 14) Где посмотреть номер ячейки в vscode?
# 15) В каком формате ipynb отправляется в гитхаб? причём здесь JSON?
# 16) Где посмотреть в какой ячейке ошибка?
# 17) Как запустить терминал?
# 18) Что такое линтер?
# 19) В какой сайт нужно вставлять код ошибки если ошибка связана с pylint?
# 20) Секция pydocstyle в большинстве случае автоматический закрывается после исправления ошибок в каком линтере?
# 21) Что такое описание модуля? Оно должно отражать информацию о том что находится в модуле?
# 21) С какой  git команды начинается утро программиста?
# 22) После внесения изменений в файлах, кнопка open in vs code пропадает в кошке, как по другому открыть vs code из кошки?
# 23) Что такое stash?
#   Общее объяснение концепции.
# 23.1) Как сохранить стэш?
#   git командa(подсказка: https://t.me/c/1937296927/3602/19531):
#
#   Кнопка в vs code:
#
# 23.2) Как восстановить стэш(подсказка: https://t.me/c/1937296927/3602/25747)?:
#
#       git команда(подсказка: https://t.me/c/1937296927/3602/19531)?:
#
# 23.3) Различие между стэшем и коммитом.
#   Когда лучше сохранить изменения в стэше, а когда коммитить.
# 23.4) Как просмотреть список сохраненных стэшей?
#   git команда (подсказка: https://t.me/c/1937296927/3602/19531):
#
# 23.5) Как удалить стэш?
#   Команды для удаления отдельных стэшей или всех сразу.
#   git команда (подсказка: https://t.me/c/1937296927/3602/19531):
#
# 23.6) Практические примеры использования стэша.
#   Краткие сценарии, где стэш помогает.
#
# 24) Где посмотреть что есть конфликт в файлах?
# 24.1) Когда он появляется?
# 25) Как решить конфликт в файлах?
# 26) Напишиие правильное утверждение
# -Зелёное то что пришло с гитхаба и синее локальные изменения или синее то что пришло с гитхаба и зелёное это локальные изменения
# 27) Если мы работаем в одном файле, можно ли принять pull после того как вы спрячете в стэш свои изменения?
# 27.1) Что может произойти когда stash восстановите после принятия pull?
# 28) Сколько способов решения конфликтов было показано в видео? Напишите ЧИСЛО и укажите их способы.
# 29) Что делает кнопка complete merge?
# 30) В какой чат нужно писать если остались вопросы?
# 31) Что такое FORK? Зачем его делают?
# 32) Как скачать форкнутый репозиторий на локальный компьютер?
# 33) С какой вероятностью ваши ошибки были уже решены? и кто их решил?
# 34) Как создать файл в vs code?
# 35) Файл лога нужно заполнять в конце каждого урока?
# ==================
#
# Дополнительные вопросы:
# 1)Какая команда конвертирует файл в py из ipynb?
# подсказка https://t.me/c/1937296927/1/26527
# 2) Что такое пакетный менеджер? Вы пользуетесь пакетным менеджером conda или pip? Какой лучше использовать для дата сайнс?
# 3) Почему расширение py лучше чем ipynb?
# 4) Что такое pep8?
# подсказка:https://peps.python.org/pep-0008/
# 4.1) линтеры проверяют на соблюдение pep8?
# 4.2) Какая нотация используется для создания переменных?
# ответ на 85-95 страницы https://t.me/c/1937296927/1/16676
# 4.3) Может ли переменная состоять из одной буквы например андерскор  "_" ?
# 4.4) Зачем и где мы используем андерскор _
# 4.5) По PEP8 допустима переменная в одну букву?
# ответ на 85-95 страницы https://t.me/c/1937296927/1/16676

#
